import 'package:flutter/material.dart';
import 'package:intl/intl.dart';

DateFormat namazTimeFormat = DateFormat.jm(DateFormat('hh:mm a'));
String app_logo =
    '<svg width="250" height="79" viewBox="0 0 250 79" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M53.8425 22.687H48.0923L61.2131 51.5947C58.0767 55.4107 55.8289 58.5995 54.4175 61.1086C53.0061 63.6178 52.2742 65.8656 52.2742 67.9566C52.2742 68.6884 52.5879 69.002 53.1629 69.002C53.2152 69.002 53.4765 68.8975 53.8947 68.7407C54.3129 68.5838 54.888 68.427 55.5152 68.2702C56.1425 68.1134 56.6653 68.0088 57.1357 68.0088C58.5472 68.0088 59.7495 68.4793 60.6904 69.368C61.6313 70.2566 62.1541 71.5112 62.1541 73.1317C62.1541 74.6477 61.6836 75.9022 60.6904 76.8955C59.7495 77.8364 58.4426 78.3591 56.8744 78.3591C55.0448 78.3591 53.6334 77.7318 52.5356 76.5295C51.4379 75.2749 50.9151 73.6544 50.9151 71.6158C50.9151 67.9043 52.3788 63.6701 55.2539 58.9654L38.3693 22.687H34.0828V22.4257H53.7902V22.687H53.8425ZM61.3177 51.7515L61.2131 51.5947L64.6632 47.2559L61.3177 51.7515ZM68.6884 19.7074C70.5702 19.7074 72.0339 20.3347 73.0794 21.5893C74.1249 22.8439 74.6999 24.5689 74.6999 26.6599C74.6999 29.6918 73.8635 32.776 72.243 35.9647C70.6225 39.1534 68.0611 42.9172 64.6632 47.2037C67.6952 43.074 69.8907 39.7807 71.2498 37.2193C72.6089 34.6578 73.2885 32.3055 73.2885 30.2145C73.2885 29.4304 72.9749 29.0645 72.3998 29.0645C72.3476 29.0645 72.0862 29.169 71.668 29.3781C71.2498 29.5872 70.6748 29.7963 70.0475 30.0054C69.4202 30.2145 68.8452 30.3191 68.3747 30.3191C67.0156 30.3191 65.8133 29.8486 64.8201 28.8554C63.8269 27.9145 63.3041 26.6076 63.3041 25.0394C63.3041 23.5234 63.8269 22.2166 64.8201 21.2234C65.8133 20.2301 67.1201 19.7074 68.6884 19.7074Z" fill="#1F3D73"/> <path d="M96.7072 22.687H90.957L104.078 51.5947C100.941 55.4107 98.6936 58.5995 97.2822 61.1086C95.8708 63.6178 95.139 65.8656 95.139 67.9566C95.139 68.6884 95.4526 69.002 96.0276 69.002C96.0799 69.002 96.3413 68.8975 96.7595 68.7407C97.1777 68.5838 97.7527 68.427 98.38 68.2702C99.0073 68.1134 99.53 68.0088 100 68.0088C101.412 68.0088 102.614 68.4793 103.555 69.368C104.496 70.2566 105.019 71.5112 105.019 73.1317C105.019 74.6477 104.548 75.9022 103.555 76.8955C102.614 77.8364 101.307 78.3591 99.7391 78.3591C97.9095 78.3591 96.4981 77.7318 95.4003 76.5295C94.3026 75.2749 93.7798 73.6544 93.7798 71.6158C93.7798 67.9043 95.2435 63.6701 98.1186 58.9654L81.2863 22.7393H76.9998V22.4779H96.7072V22.687ZM104.182 51.7515L104.078 51.5947L107.528 47.2559L104.182 51.7515ZM111.605 19.7074C113.487 19.7074 114.951 20.3347 115.996 21.5893C117.042 22.8439 117.617 24.5689 117.617 26.6599C117.617 29.6918 116.781 32.776 115.16 35.9647C113.54 39.1534 110.978 42.9172 107.58 47.2037C110.612 43.074 112.808 39.7807 114.167 37.2193C115.526 34.6578 116.205 32.3055 116.205 30.2145C116.205 29.4304 115.892 29.0645 115.317 29.0645C115.265 29.0645 115.003 29.169 114.585 29.3781C114.167 29.5872 113.592 29.7963 112.964 30.0054C112.337 30.2145 111.762 30.3191 111.292 30.3191C109.933 30.3191 108.73 29.8486 107.737 28.8554C106.744 27.9145 106.221 26.6076 106.221 25.0394C106.221 23.5234 106.744 22.2166 107.737 21.2234C108.678 20.2301 109.985 19.7074 111.605 19.7074Z" fill="#1F3D73"/> <path d="M160.639 57.2403H160.9C160.796 59.3835 160.012 61.1608 158.652 62.6768C157.241 64.1405 155.359 64.8723 153.007 64.8723C148.25 64.8723 145.479 62.154 144.8 56.6652C141.977 62.2063 137.638 64.9769 131.836 64.9769C128.647 64.9769 126.033 64.0359 123.89 62.2063C121.799 60.3767 120.754 57.9721 120.754 54.9402C120.754 49.8696 123.681 46.3672 129.483 44.4853C129.797 44.3808 130.581 44.1194 131.836 43.7535C133.09 43.3876 133.927 43.1262 134.345 42.9694C134.763 42.8126 135.547 42.5512 136.697 42.133C137.795 41.7148 138.631 41.3489 139.102 41.0352C139.572 40.7216 140.2 40.3034 141.088 39.7806C141.925 39.2579 142.552 38.7352 142.918 38.1601C143.284 37.5851 143.702 36.9056 144.172 36.1737C144.643 35.4419 144.957 34.6055 145.166 33.7168C145.375 32.8282 145.427 31.835 145.427 30.7895C145.427 24.8825 142.029 21.9028 135.234 21.9028C132.202 21.9028 129.64 22.687 127.445 24.3075C125.354 25.8757 124.308 27.2871 124.308 28.4371C124.308 28.7508 124.465 28.9076 124.779 28.9076L125.824 28.4894C126.556 28.228 127.183 28.0712 127.706 28.0712C129.065 28.0712 130.215 28.5417 131.208 29.4303C132.149 30.319 132.672 31.5213 132.672 32.9327C132.672 34.2918 132.202 35.4419 131.208 36.3828C130.215 37.3238 129.013 37.7942 127.497 37.7942C126.086 37.7942 124.883 37.2715 123.942 36.2783C123.001 35.2851 122.479 33.9782 122.479 32.4622C122.479 29.5349 123.786 26.9734 126.399 24.7257C128.961 22.5301 132.62 21.4324 137.429 21.4324C142.5 21.4324 146.473 22.7915 149.348 25.562C152.17 28.2803 153.634 32.1486 153.634 37.0624V57.188C153.634 59.9585 154.732 61.3699 156.98 61.3699C158.025 61.3699 158.862 61.004 159.541 60.2199C160.116 59.4358 160.534 58.4426 160.639 57.2403ZM144.591 54.0515V36.4874C143.179 38.892 140.147 41.3489 135.547 43.8058C133.927 44.6944 132.515 46.0536 131.418 47.8832C130.32 49.7128 129.797 51.8037 129.797 54.1561C129.797 56.5607 130.424 58.4948 131.731 59.9062C133.038 61.3176 134.711 62.0495 136.854 62.0495C139.154 62.0495 141.036 61.3176 142.447 59.8017C143.911 58.2857 144.591 56.3516 144.591 54.0515Z" fill="#1F3D73"/> <path d="M39.8853 57.2403H40.1466C40.0421 59.3835 39.258 61.1608 37.8988 62.6768C36.4874 64.1405 34.6056 64.8723 32.2532 64.8723C27.4963 64.8723 24.7257 62.154 24.0462 56.6652C21.2234 62.2063 16.8846 64.9769 11.0821 64.9769C7.89341 64.9769 5.2797 64.0359 3.13646 62.2063C1.04549 60.3767 0 57.9721 0 54.9402C0 49.8696 2.92736 46.3672 8.7298 44.4853C9.04345 44.3808 9.82756 44.1194 11.0821 43.7535C12.3367 43.3876 13.1731 43.1262 13.5913 42.9694C14.0095 42.8126 14.7936 42.5512 15.9437 42.133C17.0414 41.7148 17.8778 41.3489 18.3483 41.0352C18.8187 40.7216 19.446 40.3034 20.3347 39.7806C21.1711 39.2579 21.7984 38.7352 22.1643 38.1601C22.5302 37.5851 22.9484 36.9056 23.4189 36.1737C23.8893 35.4419 24.203 34.6055 24.4121 33.7168C24.6212 32.8282 24.6735 31.835 24.6735 30.7895C24.6735 24.8825 21.2756 21.9028 14.48 21.9028C11.4481 21.9028 8.88662 22.687 6.69111 24.3075C4.60013 25.8757 3.55465 27.2871 3.55465 28.4371C3.55465 28.7508 3.71147 28.9076 4.02512 28.9076L5.0706 28.4894C5.80244 28.228 6.42973 28.0712 6.95248 28.0712C8.31161 28.0712 9.46164 28.5417 10.4549 29.4303C11.3958 30.319 11.9185 31.5213 11.9185 32.9327C11.9185 34.2918 11.4481 35.4419 10.4549 36.3828C9.46164 37.3238 8.25933 37.7942 6.74338 37.7942C5.33197 37.7942 4.12967 37.2715 3.18873 36.2783C2.24779 35.2851 1.72505 33.9782 1.72505 32.4622C1.72505 29.5349 3.03191 26.9734 5.64562 24.7257C8.20706 22.5301 11.8663 21.4324 16.6755 21.4324C21.7461 21.4324 25.7189 22.7915 28.594 25.562C31.4168 28.2803 32.8805 32.1486 32.8805 37.0624V57.188C32.8805 59.9585 33.9783 61.3699 36.2261 61.3699C37.2715 61.3699 38.1079 61.004 38.7875 60.2199C39.3625 59.4358 39.7807 58.4426 39.8853 57.2403ZM23.8371 54.0515V36.4874C22.4257 38.892 19.3938 41.3489 14.7936 43.8058C13.1731 44.6944 11.7617 46.0536 10.6639 47.8832C9.56619 49.7128 9.04345 51.8037 9.04345 54.1561C9.04345 56.5607 9.67074 58.4948 10.9776 59.9062C12.2845 61.3176 13.9572 62.0495 16.1005 62.0495C18.4005 62.0495 20.2824 61.3176 21.6938 59.8017C23.1575 58.2857 23.8371 56.3516 23.8371 54.0515Z" fill="#1F3D73"/> <path d="M161.371 22.4256H175.433V29.7963C176.217 27.8099 177.576 25.9803 179.615 24.3075C181.653 22.4779 184.424 21.5892 187.926 21.5892C193.781 21.5892 197.388 24.6734 198.695 30.8941C199.531 28.5417 200.942 26.3985 203.033 24.4643C205.124 22.5302 207.947 21.5892 211.502 21.5892C218.925 21.5892 222.689 26.7121 222.689 36.9579V57.0835C222.689 59.9063 223.786 61.3699 226.034 61.3699C226.975 61.3699 227.759 61.004 228.439 60.2199C229.118 59.4358 229.484 58.4426 229.589 57.2403H229.85C229.746 59.3312 228.961 61.1086 227.55 62.6245C226.139 64.1405 224.205 64.8723 221.695 64.8723C219.186 64.8723 217.252 63.9837 215.841 62.2586C214.377 60.4813 213.645 58.0767 213.645 54.9402V31.2077C213.645 28.8031 213.07 26.9212 211.92 25.5621C210.77 24.2029 209.202 23.5234 207.215 23.5234C204.811 23.5234 202.824 24.5166 201.308 26.4507C199.792 28.3849 199.008 30.8418 199.008 33.8214V63.8268H203.713V64.0882H185.469V63.8268H189.965V31.2077C189.965 28.7508 189.39 26.8689 188.292 25.5621C187.194 24.2552 185.626 23.5757 183.64 23.5757C181.235 23.5757 179.249 24.5689 177.733 26.503C176.217 28.4372 175.433 30.8941 175.433 33.8737V63.8791H180.033V64.1405H161.371V63.8791H166.389V22.687H161.371V22.4256Z" fill="#1F3D73"/> <path d="M244.644 22.4256V63.8268H249.557V64.0882H230.477V63.8268H235.548V22.687H230.477V22.4256H244.644Z" fill="#D88DBC"/> <path d="M240.409 17.2506C236.384 17.3029 233.77 13.0164 235.652 9.46177L240.566 0.00012207L245.114 9.61859C246.787 13.1732 244.278 17.1984 240.409 17.2506Z" fill="#D88DBC"/></svg>';

const String fontFamily = 'DMSans';

double getHeight(BuildContext context) {
  return MediaQuery.of(context).size.height;
}

double getWidth(BuildContext context) {
  return MediaQuery.of(context).size.width;
}

nextScreen(BuildContext context, Widget page) {
  Navigator.push(context, MaterialPageRoute(builder: (context) => page));
}

TimeOfDay getTimeFormat(String s) {
  TimeOfDay formatedTime =
      TimeOfDay(hour: int.parse(s.split(":")[0]), minute: int.parse(s.split(":")[1]));
  return formatedTime;
}

int timeInMiliseconds(String s) {
  var form = Duration(hours: int.parse(s.split(":")[0]), minutes: int.parse(s.split(":")[1]));
  return form.inMilliseconds;
}

String? getUrduMonthNames(String month) {
  Map<String, String> urduMonth = {
    'January': 'جنوری',
    'February': 'فروری',
    'March': 'مارچ',
    'April': 'اپریل',
    'May': 'مئی',
    'June': 'جون',
    'July': 'جولائی',
    'August': 'اگست',
    'September': 'ستمبر',
    'October': 'اکتوبر',
    'November': 'نومبر',
    'December': 'دسمبر'
  };
  return urduMonth[month];
}

String? getUrduDayNames(String month) {
  Map<String, String> urduMonth = {
    'Saturday': 'ہفتہ',
    'Sunday': 'اتوار',
    'Monday': 'پیر',
    'Tuesday': 'منگل',
    'Wednesday': 'بدھ',
    'Thursday': 'جمعرات',
    'Friday': 'جمعہ',
  };
  return urduMonth[month];
}

// "9:30";
// "15:30"
// "18:30"
int getNotificationDate(String s, int day) {
  var d = DateTime.now();
  var date;
  if (d.day == getDaysInMonth()) {
    date =
        DateTime(d.year, d.month + 1, day, int.parse(s.split(":")[0]), int.parse(s.split(":")[1]));
  } else {
    date = DateTime(
        d.year, d.month, d.day + day, int.parse(s.split(":")[0]), int.parse(s.split(":")[1]));
  }
  return date.millisecondsSinceEpoch;
}

int getDaysInMonth() {
  var d = DateTime.now();
  if (d.month == DateTime.february) {
    final bool isLeapYear = (d.year % 4 == 0) && (d.year % 100 != 0) || (d.year % 400 == 0);
    return isLeapYear ? 29 : 28;
  }
  const List<int> daysInMonth = <int>[31, -1, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
  return daysInMonth[d.month - 1];
}

List<Map<String, String>>? getHeading(String prayerTimings) {
  Map<String, List<Map<String, String>>> duaMap = {};
  duaMap['fajar'] = [
    {
      'en': 'The Prophetic prescription to be sufficient from everything.',
      'ur': 'ہر چیز سے کفایت کا نبوی نسخہ'
    },
    {
      'en':
          'The Prophetic prescription to be sufficient from everything of this world and the next.',
      'ur': 'دنیا و آخرت کے کاموں پر کفایت کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for freedom from Hellfire.',
      'ur': 'جہنم سے برأت کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription to attain the complete blessings of Allah (SWT).',
      'ur': 'اپنے لیے اللّٰہ تعالی کی نعمتوں کو مکمل فرمانے کا نبوی نسخہ'
    },
    {
      'en':
          'The Prophetic prescription for being thankful for all the blessings attained day and night.',
      'ur': 'دن اور رات کی نعمتوں کا شکر ادا کرنے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for attaining God’s pleasure.',
      'ur': 'رضائے الٰہی حاصل کرنے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection from the whispers of the Devil.',
      'ur': 'وساوسِ شیطان سے حفاظت کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for good (safety) in everything.',
      'ur': 'ہر قسم کی عافیت کا نبوی نسخہ'
    },
    {
      'en':
          'The Prophetic prescription for the removal of sadness/depression and the payment of debts.',
      'ur': 'زوالِ غم اور ادائیگی قرض کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for saviour from Hell fire.',
      'ur': 'جہنم سے خلاصی پانے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection from harms and witchcraft etc.',
      'ur': 'آسیب و سحر وغیرہ سے حفاظت کا نبوی نسخہ'
    },
    {
      'en': 'An easy Prophetic prescription to be safe from 3 major illnesses. 1',
      'ur': 'تین بڑی بیماریوں سے بچنے کا نبوی آسان نسخہ1'
    },
    {
      'en': 'An easy Prophetic prescription to be safe from 3 major illnesses. 2',
      'ur': 'تین بڑی بیماریوں سے بچنے کا نبوی آسان نسخہ2'
    },
    {
      'en': 'The Prophetic prescription for protection from the mischief of the Jinns.',
      'ur': 'جنات کی شرارت سے بچنے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection from the mischief of the Jinns.',
      'ur': 'جنات کی شرارت سے بچنے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection from the mischief of the Jinns.',
      'ur': 'جنات کی شرارت سے بچنے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection from the mischief of the Jinns.',
      'ur': 'جنات کی شرارت سے بچنے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection from the mischief of the Jinns.',
      'ur': 'جنات کی شرارت سے بچنے کا نبوی نسخہ'
    },
  ];
  duaMap['zuhur'] = [
    {
      'en': 'The Prophetic prescription asking for the blessings of this world and the hereafter.',
      'ur': 'دنیا و آخرت کی بھلائیاں مانگ لینے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection against sudden calamities',
      'ur': 'ناگہانی مصیبت سے بچاؤ کا نبوی نسخہ'
    },
    {'en': 'When waiting for some news.', 'ur': 'جب کسی خبر کا انتظار ہو'},
    {
      'en': 'The Prophetic prescription for describing the purity and praise of Allah (SWT).',
      'ur': 'اللّٰہ کی پاکی اور حمد بیان کرنے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for the health of the body.',
      'ur': 'بدن کی عافیت کا نبوی نسخہ'
    },
    {
      'en': 'The prophetic prescription for entrance into Paradise.',
      'ur': 'جنت میں داخل ہونے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for gaining beneficial knowledge and halal sustenance.',
      'ur': 'علم نافع اور رزق حلال ملنے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription of taking reward from Allah according to His glory.',
      'ur': 'اللّٰہ سے اس کی شان کے مطابق اجر لینے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for saviour from sufferings.',
      'ur': 'مصیبتوں سے نجات حاصل کرنے کا نبوی نسخہ'
    },
    {
      'en':
          'The Prophetic prescription for gaining great sustenance and being protected from all forms of evil.',
      'ur': 'بہترین رزق پانے کا اور برائیوں سے محفوظ رہنے کا نبوی نسخہ'
    },
    {
      'en':
          'The Prophetic prescription for the compensation of lack of dhikr (remembrance of Allah (SWT)).',
      'ur': 'ذکر کے معمولات کی کمی کی تلافی کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection from every calamity.',
      'ur': 'ہر بلا سے حفاظت کا نبوی نسخہ'
    },
    {
      'en':
          'The Prophetic prescription for being deserving of the prayers of the angels and to attain the reward of a martyr at the time of death. 1',
      'ur': 'فرشتوں کی دعاؤں کے مستحق بننے کا اور موت پر شہادت کا اجر ملنے کا نبوی نسخہ1',
    },
    {
      'en':
          'The Prophetic prescription for being deserving of the prayers of the angels and to attain the reward of a martyr at the time of death. 2',
      'ur': 'فرشتوں کی دعاؤں کے مستحق بننے کا اور موت پر شہادت کا اجر ملنے کا نبوی نسخہ2',
    },
    {
      'en': 'The Prophetic prescription for the fulfilment of all requests.',
      'ur': 'سارے مطالبوں کے پورا ہونے کا نبوی نسخہ',
    },
    {
      'en': 'Five statements for the hereafter.',
      'ur': 'پانچ جملے آخرت کے لیے',
    },
    {
      'en': 'There will be a lot of benefit.',
      'ur': 'بہت بہت فائدہ ہو گا',
    },
  ];
  duaMap['asr'] = [
    {
      'en':
          'The Prophetic prescription to be in the protection of Allah (SWT) and keep the devil away.',
      'ur': 'اللّٰہ کی حفاظت میں آنے اور شیطان کے دور ہونے کا نبوی نسخہ'
    },
    {'en': 'The Prophetic prescription for self-sufficiency.', 'ur': 'اپنی کفایت کا نبوی نسخہ'},
    {
      'en': 'The Prophetic prescription that will please the slave on the Day of Judgement.',
      'ur': 'قیامت کے دن بندہ کو راضی کیے جانے کا نبوی نسخہ'
    },
    {
      'en': 'The prophetic prescription of all the good things of this world and the hereafter',
      'ur': 'دنیا و آخرت کی تمام بھلائیوں کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection against sudden calamities.',
      'ur': 'ناگہانی آفتوں سے حفاظت کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for the health of the body.',
      'ur': 'بدن کی عافیت کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection from the whispers of the Devil.',
      'ur': 'وساوس شیطان سے حفاظت کا نبوی نسخہ'
    },
    {
      'en': 'The prophetic prescription for entrance into Paradise.',
      'ur': 'جنت میں داخل ہونے کا نبوی نسخہ'
    },
    {
      'en': 'A prophetic prescription for all kinds of well-being',
      'ur': 'ہر قسم کی عافیت کا نبوی نسخہ'
    },
    {
      'en':
          'The Prophetic prescription for the removal of sadness/ depression and the payment of debts.',
      'ur': 'زوالِ غم اور ادائیگی قرض کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for the protection against calamities.',
      'ur': 'مصیبت سے بچاؤ کا نبوی نسخہ'
    },
    {
      'en': 'Recite this dua once and have the whole family recite it too',
      'ur': 'یہ دعا خود بھی پڑھیں اور اہل خانہ سے بھی پڑھوائیں'
    },
    {
      'en':
          'The Prophetic prescription for the compensation of lack of dhikr (remembrance of Allah (SWT)).',
      'ur': 'ذکر کے معمولات کی کمی کی تلافی کا نبوی نسخہ'
    },
    {
      'en':
          'The Prophetic prescription for the compensation of lack of dhikr (remembrance of Allah (SWT)). 1',
      'ur': '1فرشتوں کی دعاؤں کے مستحق بننے کا اور موت پر شہادت کا اجر ملنے کا نبوی نسخہ'
    },
    {
      'en':
          'The Prophetic prescription for the compensation of lack of dhikr (remembrance of Allah (SWT)). 2',
      'ur': '2فرشتوں کی دعاؤں کے مستحق بننے کا اور موت پر شہادت کا اجر ملنے کا نبوی نسخہ'
    },
  ];
  duaMap['maghrib'] = [
    {
      'en': 'The Prophetic prescription for protection against every evil.',
      'ur': 'ہر موذی کے شر سے حفاظت کا نبوی نسخہ'
    },
    {
      'en':
          'The Prophetic prescription to be sufficient from everything of this world and the next.',
      'ur': 'دنیا و آخرت کے کاموں پر کفایت کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for freedman from Hellfire.',
      'ur': 'جہنم سے آزادی پانے کا نبوی نسخہ'
    },
    {
      'en':
          'The Prophetic prescription to declare having all the blessings bestowed on you by Allah (SWT).',
      'ur': 'اپنے لیے اللّٰہ تعالی کی نعمتوں کو مکمل کروانے کا نبوی نسخہ'
    },
    {
      'en':
          'The Prophetic prescription for being thankful for all the blessings one has been bestowed with.',
      'ur': 'نعمتوں کی ادائیگیِ شکر کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for saviour from Hell fire.',
      'ur': 'جہنم سے حفاظت کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription of taking reward from Allah according to His glory.',
      'ur': 'اللّٰہ سے اس کی شان کے مطابق اجر لینے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for seeking Allah’s forgiveness.',
      'ur': 'اللّٰہ سے بخشش طلب کرنے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for the fulfilment of all requests.',
      'ur': 'ساری مرادیں پوری کیے جانے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection from the mischief of the Jinns.',
      'ur': 'جنات کی شرارت سے بچنے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection from harms and witchcraft etc.',
      'ur': 'آسیب و سحر وغیرہ سے حفاظت کا نبوی نسخہ'
    },
    {
      'en': 'An important prescription for protection against magic.',
      'ur': 'جادو سے حفاظت کا اہم نسخہ'
    },
    {'en': 'When waiting for some news.', 'ur': 'جب کسی خبر کا انتظار ہو'},
    {
      'en': 'The Prophetic prescription for protection from the mischief of the Jinns.',
      'ur': 'جنات کی شرارت سے بچنے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection from the mischief of the Jinns.',
      'ur': 'جنات کی شرارت سے بچنے کا نبوی نسخہ'
    },
  ];
  duaMap['isha'] = [
    {
      'en': 'The Prophetic prescription for protection from every harmful animal.',
      'ur': 'ہر موذی جانور سے حفاظت کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection from every calamity. 1',
      'ur': 'ہر بلا سے حفاظت کا نبوی نسخہ1'
    },
    {
      'en': 'The Prophetic prescription for protection from every calamity. 2',
      'ur': 'ہر بلا سے حفاظت کا نبوی نسخہ2'
    },
    {
      'en': 'Another prophetic prescription to avoid the evil of jinn',
      'ur': 'جنات کی شرارت سے بچنے کا ایک اور نبوی نسخہ'
    },
    {'en': 'During the evening.', 'ur': 'منجیات'},
    {'en': 'The Prophet\'s prescription for supplicating', 'ur': 'مستجاب الدعا ہونے کا نبوی نسخہ'},
    {
      'en': 'The Prophetic prescription for opening the doors of the Heavens.',
      'ur': 'آسمان کے دروازے کھلوانے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription. For protection against the evil of the Devil.',
      'ur': 'شیطان کے شر سے بچنے کا نبوی نسخہ'
    },
    {'en': 'Remedy for increase in wealth.', 'ur': 'مال و مَنال میں اضافہ کا ایک نسخہ'},
    {
      'en': 'To praise (Allah SWT) and send salutations (on the Prophet (SAW)) in the best way.',
      'ur': 'حمد و درود بہترین انداز میں'
    },
    {'en': 'Remedy for the forgiveness of all sins.', 'ur': 'سارے گناہ معاف کروانے کا نسخہ'},
    {
      'en': 'The Prophetic prescription to remove illness and poverty.',
      'ur': 'بیماری اور تنگدستی دور کرنے کا نبوی نسخہ'
    },
    {
      'en': 'Remedy to protect oneself from sin all day',
      'ur': 'سارا دن گناہوں سے بچنے کا اہم نسخہ'
    },
  ];
  return duaMap[prayerTimings];
}

List<Map<String, String>>? getDuaMap(String prayerTime, String languageSelected) {
  var headingList = getHeading(prayerTime);
  Map<String, List<Map<String, String>>> duaMap = {};
  duaMap['fajar'] = [
    {
      'dua':
          'بِسۡمِ ٱللهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِيمِ\nقُلۡ هُوَ ٱللَّهُ أَحَدٌ (١) ٱللَّهُ ٱلصَّمَدُ (٢) لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ (٣) وَلَمۡ يَكُن لَّهُ ۥ ڪُفُوًا أَحَدٌ (٤)\n\nبِسۡمِ ٱللهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِيمِ\nقُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ (١) مِن شَرِّ مَا خَلَقَ (٢) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (٣) وَمِن شَرِّ ٱلنَّفَّـٰثَـٰتِ فِى ٱلۡعُقَدِ (٤) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ (٥)\n\nبِسۡمِ ٱللهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِيمِ\nقُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ (١) مَلِكِ النَّاسِ (٢) إِلَـٰهِ ٱلنَّاسِ (٣) مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ (٤) ٱلَّذِى يُوَسۡوِسُ فِى صُدُورِ ٱلنَّاسِ (٥) مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ (٦)',
      'times': '3',
      'description': ''
    },
    {
      'dua':
          'حَسْبِـيَ اللّٰهُ لَآ إلٰهَ إلَّا هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم',
      'times': '7',
      'description': 'مذکورہ دعا چاہے سچے دل سے پڑھے یا جھوٹے دل سے پڑھے پریشانی دور ہو گی'
    },
    {
      'dua':
          'اللّٰهُمَّ اِنِّی اَصْبَحْتُ اُشْهِدُكَ ، وَاُشْهِدُ حَمَلَةَ عَرْشِكَ وَمَلَائِكَتَكَ وَجَمِيعَ خَلْقِكَ ، اَنَّكَ اَنْتَ اللّٰهُ ، لَا اِلَهَ اِلَّا اَنْتَ ، وَحْدَكَ لَا شَرِيكَ لَكَ ، وَاَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ',
      'times': '4',
      'description': '',
    },
    {
      'dua':
          'اللّٰهُمَّ اِنِّی اَصْبَحْتُ مِنْكَ فِي نِعْمَةٍ وَعَافِيَةٍ وَسِتْرٍ؛ فَاَتْمِمْ عَلَيَّ نِعْمَتَكَ وَعَافِيَتَكَ وَسِتْرَكَ فِي الدُّنْيَا وَالْآخِرَةِ',
      'times': '3',
      'description': '',
    },
    {
      'dua':
          'اللّٰهُمَّ مَا اَصْبَـَحَ بِي مِـنْ نِعْمَةٍ أَو باَحَدٍ مِـنْ خَلْقِك ، فَمِنْكَ وَحْـدَكَ لَا شَرِيْكََ لَكَ ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْر',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'رَضِيْتُ بِاللّٰهِ رَبًّا ، وَبِالْاِسْلَامِ دِينًا ، وَبِمُحَمَّدٍ صَلَّی اللّٰهُ عَلَیْهِ وَسَلَّمَ نَبِيًّا',
      'times': '3',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ فَاطِرَ السَّمَوَاتِ وَالاَرْضِ عَالِمَ الغَيْبِ وَالشَّهَادةِ، رَبَّ كُلِّ شَيءٍ وَمَلِيكَهُ، اَشْهَدُ اَنْ لَا اِلٰهَ اِلاَّ اَنْتَ، اَعُوذُبِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ وَ اَنْ اَقْتَرِفَ عَلٰی نَفْسِی سُوْٓءً اَوْ اَجُرَّہُ اِلٰی مُسْلِمٕ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ اِنِّي اَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْیَا وَالْاَخِرَۃِ اللّٰهُمَّ اِنِّي اَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِی دِينِی وَدُنْيَايَ وَاَهْلِی وَمَالِی ، اللّٰهُمَّ اسْتُرْ عَوْرَاتِی وَآمِنْ رَوْعَاتِی ، اللّٰهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَّمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي وَاَعُوذُ بِعَظَمَتِكَ اَنْ اُغْتَالَ مِنْ تَحْتِي',
      'times': '1',
      'description': '',
    },
    {
      'dua':
          'اللّٰهُمَّ اِنِّی اَعُوذُبِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَاَعُوذُبِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَاَعُوذُبِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَاَعُوذُبِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ',
      'times': '1',
      'description': ''
    },
    {'dua': 'اللّٰھُمَّ اَجِرْنِیْ مِنَ النَّارِ', 'times': '7', 'description': ''},
    {
      'dua':
          'اَعُوذُ بِوَجْهِ اللّٰهِ الْعَظِیمِ، الَّذِی لَیْسَ شَیْءٌ اَعْظَمَ مِنْهُ، وَبِکَلِمَاتِ اللّٰهِ التَّامَّاتِ، الَّتِی لَا یُجَاوِزُهُنَّ بَرٌّ وَلاَ فَاجِرٌ، وَبِاَسْمَاء ِ اللّٰهِ الْحُسْنٰی کُلِّها, مَا عَلِمْتُ مِنْها وَمَا لَمْ اَعْلَمْ، مِنْ شَرِّ مَا خَلَقَ وَبَرَاَ وَذَرَاَ',
      'times': '1',
      'description': ''
    },
    {'dua': 'سُبْحَانَ اللّٰهِ الْعَظِیْمِ وَبِحَمْدِہٖ', 'times': '3', 'description': ''},
    {
      'dua':
          'اَللّٰهُمَّ اِنِّیْ اَسْئَلُك مِمَّا عِنْدَك وَاَفِضْ عَلَیَّ مِنْ فَضْلِكَ وَانْشُرْ عَلَیَّ مِنْ بَرَکَاتِكَ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَفَحَسِبۡتُمۡ اَنَّمَا خَلَقۡنٰكُمۡ عَبَثًا وَّاَنَّكُمۡ اِلَيۡنَا لَا تُرۡجَعُوۡنَ‏ ﴿۱۱۵﴾  فَتَعٰلَى اللّٰهُ الۡمَلِكُ الۡحَـقُّ‌ ۚ لَاۤ اِلٰهَ اِلَّا هُوَ‌ۚ رَبُّ الۡعَرۡشِ الۡـكَرِيۡمِ‏ ﴿۱۱۶﴾  وَمَنۡ يَّدۡعُ مَعَ اللّٰهِ اِلٰهًا اٰخَرَۙ لَا بُرۡهَانَ لَهٗ بِهٖۙ فَاِنَّمَا حِسَابُهٗ عِنۡدَ رَبِّهٖؕ اِنَّهٗ لَا يُفۡلِحُ الۡـكٰفِرُوۡنَ‏ ﴿۱۱۷﴾  وَقُلْ رَّبِّ اغۡفِرۡ وَارۡحَمۡ وَاَنۡتَ خَيۡرُ الرّٰحِمِيۡنَ‏ ﴿۱۱۸﴾',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ بِكَ اَصْبَحْنَا وَبِكَ اَمْسَيْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَاِلَيْكَ النُّشُورُ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَصْبَحْنَا وَاَصْبَحَ الْمُلْکُ لِلّٰهِ رَبِّ الْعَالَمِیْنَ اَللّٰھُمَّ اِنِّیْ اَسْأَلُك خَیْرَ ھٰذَا الْیَوْمِ وَفَتْحَهُ وَنَصْرَہ وَ بَرَکَتَهُ وَ ھُدَاہُ وَاَعُوْذُبِكَ مَنْ شَرِّ مَا فِیْهِ وَشَرِّ مَا بَعْدَہ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اللّٰھُمَّ اجْعَلْ اَوَّلَ ھَذَا النَھَارِ صَلَاحًا وَاَوْسَطَهُ فَلَاحًا وآخِرَہُ نجَاحًا وَاَسْاَلُكَ خَیْرَ الدُّنْیَا وَ الْآخِرَةِ یَا اَرْحَمَ الرَّاحِمِیْن',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَصْبَحْنَا عَلٰی فِطْرَۃِ الْاِسْلَامِ وَ کَلِمَةِ الْاِخْلَاصِ وَعَلٰی دِینِ نَبِیِّنَا مُحَمَّدٍ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ وَعَلٰی مِلَّةِ اَبِیْنَا اِبْرَاہِیمَ حَنِیفًا مُسْلِمًا وَمَا کَانَ مِنَ الْمُشْرِکِینَ',
      'times': '1',
      'description': ''
    }
  ];
  duaMap['zuhur'] = [
    {
      'dua':
          'يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ اَسْتَغِيثُ، اَصْلِحْ لِي شَأْنِی كُلَّهُ، وَلَا تَكِلْنِی اِلَى نَفْسِی طَرَفَةَ عَيْنٍ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'بِسْمِ اللّٰهِ الَّذِی لَا يَضُرُّ مَعَ اسْمِهِ شَیْءٌ فِی الأرضِ وَلاَ فِی السَّمَاءِ وَهُوَ السَّمِيعُ العَلِيْمُ',
      'times': '3',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ اِنِّي اَسْاَلُك مِن فُجَآءَةِ الخَيِرِ وَاَعُوْذُ بِكَ مِنْ فُجَآءَةِ الشَّرِّ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'سُبْحَانَ اللّٰهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ',
      'times': '3',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ عَافِنِی فِي بَدَنِی اللّٰهُمَّ عَافِنِي فِی سَمْعِي اللّٰهُمَّ عَافِنِی فِی بَصَرِیْ لَا اِلَهَ اِلاَّ اَنْتَ اللّٰهُمَّ اِنِّي اَعُوذُبِكَ مِنَ الْكُفْرِ وَالفَقْرِ وَاَعُوذُبِكَ مِنْ عَذَابِ القَبْرِ لَا اِلَهَ اِلاَّ أَنْتَ',
      'times': '3',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ اَنْتَ رَبِّی لّا اِلَهَ اِلَّا أَنْتَ، خَلَقْتَنِیْ وَاَنَا عَبْدُكَ، وَاَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتَ، اَعُوذُبِكَ مِنْ شَرِّ مَا صَنَعْتَ، اَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَاَبُوءُ لَكَ بِذَنْبِیْ فَاغْفِر لِی فَاِنَّهُ لَا يَغْفِرُ الذُّنُوبَ اِلَّا أَنْتَ',
      'times': '1',
      'description': ''
    },
    {
      'heading': '',
      'dua':
          'اللّٰهُمَّ اِنِّي اَسْأَلُكَ عِلْماً نَافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً',
      'times': '1',
      'description': ''
    },
    {
      'dua': 'یَا رَبِّ لَكَ الْحَمْدَ کَمَا یَنْبَغِیْ لِجَلَالِ وَجْهِكَ وَ عَظِیْمِ سُلْطَانِكَ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَللّٰهُمَّ اَنۡتَ رَبِّیۡ لَآ اِلٰهَ اِلَّآ اَنۡتَ عَلَیۡكَ تَوَکَّلۡتُ وَ اَنۡتَ رَبُّ الۡعَرۡشِ الۡعَظِیۡمِ مَا شَآءَ اللّٰهُ کَانَ وَمَا لَمۡ یَشَاۡ لَمۡ یَکُنۡ وَلَا حَوۡلَ وَلَا قُوَّۃَ اِلَّا بِاللّٰهِ الۡعَلِیِّ الۡعَظِیۡمِ اَعۡلَمُ اَنَّ اللّٰهَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ وَّ اَنَّ اللّٰهَ قَدۡ اَحَاطَ بِکُلِّ شَیۡءٍ عِلۡمًا اَللّٰهُمَّ اِنِّیۡ اَعُوۡذُبِكَ مِنۡ شَرِّ نَفۡسِیۡ وَ مِنۡ شَرِّ کُلِّ دَآبَّةٍ اَنۡتَ اٰخِذٌ بِنَاصِیَتِھَا اِنَّ رَبِّیۡ عَلٰی صِرَاطٍ مُّسۡتَقِیۡمٍ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'مَا شَآءَ اللّٰهُ لَا حَوْلَ وَ لَا قُوَّةَ اِلَّا بِاللّٰهِ اَشْھَدُ اَنَّ اللّٰهَ عَلٰی کُلِّ شَیْءٍ قَدِیْرٌ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'فَسُبۡحٰنَ اللّٰهِ حِيۡنَ تُمۡسُوۡنَ وَحِيۡنَ تُصۡبِحُوۡنَ‏ ﴿۱۷﴾  وَلَـهُ الۡحَمۡدُ فِىۡ السَّمٰوٰتِ وَالۡاَرۡضِ وَعَشِيًّا وَّحِيۡنَ تُظۡهِرُوۡنَ‏ ﴿۱۸﴾  يُخۡرِجُ الۡحَـىَّ مِنَ الۡمَيِّتِ وَيُخۡرِجُ الۡمَيِّتَ مِنَ الۡحَـىِّ وَيُحۡىِ الۡاَرۡضَ بَعۡدَ مَوۡتِهَا  ‌ؕ وَكَذٰلِكَ تُخۡرَجُوۡنَ‏ ﴿۱۹﴾',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ الۡحَـىُّ الۡقَيُّوۡمُۚ  لَا تَاۡخُذُهٗ سِنَةٌ وَّلَا نَوۡمٌ‌ؕ لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ‌ؕ مَنۡ ذَا الَّذِىۡ يَشۡفَعُ عِنۡدَهٗۤ اِلَّا بِاِذۡنِهٖ‌ؕ يَعۡلَمُ مَا بَيۡنَ اَيۡدِيۡهِمۡ وَمَا خَلۡفَهُمۡ‌ۚ وَلَا يُحِيۡطُوۡنَ بِشَىۡءٍ مِّنۡ عِلۡمِهٖۤ اِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرۡسِيُّهُ السَّمٰوٰتِ وَالۡاَرۡضَ‌‌ۚ وَلَا يَـــُٔوۡدُهٗ حِفۡظُهُمَا ‌ۚ وَ هُوَ الۡعَلِىُّ الۡعَظِيۡمُ‏ ﴿۲۵۵﴾\n\n(سورہ مومن کی ابتدائی تین آیتیں)\nحٰمٓ‌ ۚ‏ ﴿۱﴾  تَنۡزِيۡلُ الۡكِتٰبِ مِنَ اللّٰهِ الۡعَزِيۡزِ الۡعَلِيۡمِۙ‏ ﴿۲﴾  غَافِرِ الذَّنۡۢبِ وَقَابِلِ التَّوۡبِ شَدِيۡدِ الۡعِقَابِ ذِى الطَّوۡلِؕ لَاۤ اِلٰهَ اِلَّا هُوَؕ اِلَيۡهِ الۡمَصِيۡرُ‏ ﴿۳﴾',
      'times': '1',
      'description': 'آیۃ الکرسی پڑھ کر پھر سورہ مومن کی نیچے والی تین آیتیں صبح کے وقت پڑھ لیں'
    },
    {
      'dua': 'اَعُوْذُ بِاللّٰهِ السَّمِیْعِ الْعَلِیْمِ مِنَ الشَّیْطٰنِ الرَّجِیْم',
      'times': '3',
      'description': ''
    },
    {
      'heading': '',
      'dua':
          'هُوَ اللّٰهُ الَّذِىۡ لَاۤ اِلٰهَ اِلَّا هُوَ‌ ۚ عٰلِمُ الۡغَيۡبِ وَالشَّهَادَةِ‌ ۚ هُوَ الرَّحۡمٰنُ الرَّحِيۡمُ‏ ﴿۲۲﴾  هُوَ اللّٰهُ الَّذِىۡ لَاۤ اِلٰهَ اِلَّا هُوَ‌ۚ اَلۡمَلِكُ الۡقُدُّوۡسُ السَّلٰمُ الۡمُؤۡمِنُ الۡمُهَيۡمِنُ الۡعَزِيۡزُ الۡجَـبَّارُ الۡمُتَكَبِّرُ‌ؕ سُبۡحٰنَ اللّٰهِ عَمَّا يُشۡرِكُوۡنَ‏ ﴿۲۳﴾  هُوَ اللّٰهُ الۡخَـالِـقُ الۡبَارِئُ الۡمُصَوِّرُ‌ لَـهُ الۡاَسۡمَآءُ الۡحُسۡنٰى‌ؕ يُسَبِّحُ لَهٗ مَا فِى السَّمٰوٰتِ وَالۡاَرۡضِ‌ۚ وَهُوَ الۡعَزِيۡزُ الۡحَكِيۡمُ‏ ﴿۲۴﴾',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَللّٰھُمَّ اَنْتَ خَلَقْتَنِیْ، وَاَنْتَ تَھْدِیْنِیْ، وَاَنْتَ تُطْعِمُنِیْ، وَاَنْتَ تَسْقِیْنِیْ، وَاَنْتَ تُمِیْتُنِیْ ، وَاَنْتَ تُحْیِیْنِیْ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'دنیا کے لیے (ایک مرتبہ)\n١) " حَسْبِیَ اللّٰهُ لِدِیْنِیْ "\n٢) " حَسْبِیَ اللّٰهُ لِمَآ اَھَمَّنِیْ "\n٣) " حَسْبِیَ اللّٰهُ لِمَنْۢ بَغٰی عَلَیَّ "\n٤) " حَسْبِیَ اللّٰهُ لِمَنْ حسَدَنِیْ "\n٥) " حَسْبِیَ اللهُ لِمَنْ کَادَنِیْ بِسُوْۤءٍ "\n\nآخرت کے لیے (ایک مرتبہ)\n١) " حَسْبِیَ اللّٰهُ عِنْدَ الْمَوْتِ "\n٢) " حَسْبِیَ اللّٰهُ عِنْدَ الْمَسْاَلَةِ فِی الْقَبْرِ "\n٣) " حَسْبِیَ اللّٰهُ عِنْدَ الْمِیْزَانِ "\n٤) " حَسْبِیَ اللّٰهُ عِنْدَ الصِّرَاطِ "\n٥) " حَسْبِیَ اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ عَلَیْهِ تَوَکَّلْتُ وَ اِلَیْهِ اُنِیْبُ "\n',
      'times': '1',
      'description': ''
    },
    {
      'dua': 'فَاللّٰهُ خَیْرٌ حٰفِظًا۔ وَّھُوَ اَرْحَمُ الرّٰحِمِیْنَ',
      'times': '3',
      'description': ''
    }
  ];
  duaMap['asr'] = [
    {
      'dua':
          'اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ الۡحَىُّ الۡقَيُّوۡمُۚ لَا تَاۡخُذُهٗ سِنَةٌ وَّلَا نَوۡمٌ‌ؕ لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ‌ؕ مَنۡ ذَا الَّذِىۡ يَشۡفَعُ عِنۡدَهٗۤ اِلَّا بِاِذۡنِهٖ‌ؕ يَعۡلَمُ مَا بَيۡنَ اَيۡدِيۡهِمۡ وَمَا خَلۡفَهُمۡ‌ۚ وَلَا يُحِيۡطُوۡنَ بِشَىۡءٍ مِّنۡ عِلۡمِهٖۤ اِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرۡسِيُّهُ السَّمٰوٰتِ وَالۡاَرۡضَ‌‌ۚ وَلَا يَــئُوۡدُهٗ حِفۡظُهُمَا ‌ۚ وَ هُوَ الۡعَلِىُّ الۡعَظِيۡمُ ۞',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اٰمَنَ الرَّسُوۡلُ بِمَاۤ اُنۡزِلَ اِلَيۡهِ مِنۡ رَّبِّهٖ وَ الۡمُؤۡمِنُوۡنَ‌ؕ كُلٌّ اٰمَنَ بِاللّٰهِ وَمَلٰٓئِكَتِهٖ وَكُتُبِهٖ وَرُسُلِهٖ ۚ  لَا نُفَرِّقُ بَيۡنَ اَحَدٍ مِّنۡ رُّسُلِهٖ‌  ۚ   وَقَالُوۡا سَمِعۡنَا وَاَطَعۡنَا‌ ۖ غُفۡرَانَكَ رَبَّنَا وَاِلَيۡكَ الۡمَصِيۡرُ ۞ لَا يُكَلِّفُ اللّٰهُ نَفۡسًا اِلَّا وُسۡعَهَا ‌ؕ لَهَا مَا كَسَبَتۡ وَعَلَيۡهَا مَا اكۡتَسَبَتۡ‌ؕ رَبَّنَا لَا تُؤَاخِذۡنَاۤ اِنۡ نَّسِيۡنَاۤ اَوۡ اَخۡطَاۡنَا ‌ۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَيۡنَاۤ اِصۡرًا كَمَا حَمَلۡتَهٗ عَلَى الَّذِيۡنَ مِنۡ قَبۡلِنَا ‌‌ۚرَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهٖ‌ ۚ وَاعۡفُ عَنَّا وَاغۡفِرۡ لَنَا وَارۡحَمۡنَا ۚ اَنۡتَ مَوۡلٰٮنَا فَانۡصُرۡنَا عَلَى الۡقَوۡمِ الۡكٰفِرِيۡنَ ۞',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'رَضِيْتُ بِاللّٰهِ رَبًّا ، وَبِالْاِسْلَامِ دِينًا ، وَبِمُحَمَّدٍ صَلَّی اللّٰهُ عَلَیْهِ وَسَلَّمَ نَبِيًّا',
      'times': '3',
      'description': ''
    },
    {
      'dua':
          'يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ اَسْتَغِيثُ، اَصْلِحْ لِي شَأْنِی كُلَّهُ، وَلَا تَكِلْنِی اِلَى نَفْسِی طَرَفَةَ عَيْنٍ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'بِسْمِ اللّٰهِ الَّذِی لَا يَضُرُّ مَعَ اسْمِهِ شَیْءٌ فِی الأرضِ وَلاَ فِی السَّمَاءِ وَهُوَ السَّمِيعُ العَلِيْمُ',
      'times': '3',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ عَافِنِی فِي بَدَنِی اللّٰهُمَّ عَافِنِي فِی سَمْعِي اللّٰهُمَّ عَافِنِی فِی بَصَرِیْ لَا اِلَهَ اِلاَّ اَنْتَ اللّٰهُمَّ اِنِّی اَعُوذُبِكَ مِنَ الْكُفْرِ وَالفَقْرِ وَاَعُوذُبِكَ مِنْ عَذَابِ القَبْرِ لَا اِلَهَ اِلاَّ أَنْتَ',
      'times': '3',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ فَاطِرَ السَّمَوَاتِ وَالاَرْضِ عَالِمَ الغَيْبِ وَالشَّهَادةِ، رَبَّ كُلِّ شَيءٍ وَمَلِيكَهُ، اَشْهَدُ اَنْ لَا اِلٰهَ اِلاَّ اَنْتَ، اَعُوذُبِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ وَ اَنْ اَقْتَرِفَ عَلٰی نَفْسِی سُوْٓءً اَوْ اَجُرَّہُ اِلٰی مُسْلِمٕ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ اَنْتَ رَبِّی لّا اِلَهَ اِلَّا أَنْتَ، خَلَقْتَنِیْ وَاَنَا عَبْدُكَ، وَاَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتَ، اَعُوذُبِكَ مِنْ شَرِّ مَا صَنَعْتَ، اَبُوءُ لَكَ بِنِعْمَتِكَ عَلَیَّ، وَاَبُوءُ لَكَ بِذَنْبِیْ فَاغْفِر لِی فَاِنَّهُ لَا يَغْفِرُ الذُّنُوبَ اِلَّا أَنْتَ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ اِنِّی اَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْیَا وَالْاَخِرَۃِ اللّٰهُمَّ اِنِّي اَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَایَ وَاَهْلِی وَمَالِی ، اللّٰهُمَّ اسْتُرْ عَوْرَاتِی وَآمِنْ رَوْعَاتِی ، اللّٰهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِی وَعَنْ يَّمِينِی وَعَنْ شِمَالِی وَمِنْ فَوْقِی وَاَعُوذُ بِعَظَمَتِكَ اَنْ اُغْتَالَ مِنْ تَحْتِی',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ اِنِّي اَعُوذُبِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَاَعُوذُبِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَاَعُوذُبِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَاَعُوذُبِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَللّٰهُمَّ اَنۡتَ رَبِّیۡ لَآ اِلٰهَ اِلَّا اَنۡتَ عَلَیۡكَ تَوَکَّلۡتُ وَ اَنۡتَ رَبُّ الۡعَرۡشِ الۡعَظِیۡمِ مَا شَآءَ اللّٰهُ کَانَ وَمَا لَمۡ یَشَاۡ لَمۡ یَکُنۡ وَلَا حَوۡلَ وَلَا قُوَّۃَ اِلَّا بِاللّٰهِ الۡعَلِیِّ الۡعَظِیۡمِ اَعۡلَمُ اَنَّ اللّٰهَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ وَّ اَنَّ اللّٰهَ قَدۡ اَحَاطَ بِکُلِّ شَیۡءٍ عِلۡمًا اَللّٰهُمَّ اِنِّیۡ اَعُوۡذُبِكَ مِنۡ شَرِّ نَفۡسِیۡ وَ مِنۡ شَرِّ کُلِّ دَآبَّةٍ اَنۡتَ اٰخِذٌ بِنَاصِیَتِھَا اِنَّ رَبِّیۡ عَلٰی صِرَاطٍ مُّسۡتَقِیۡمٍ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'سُبْحَانَ اللّٰهِ عَدَدَ مَا خَلَقَ، سُبْحَانَ اللّٰهِ مِلْءَ مَا خَلَقَ، سُبْحَانَ اللّٰهِ عَدَدَ مَا فِی الْأَرْضِ وَالسَّمَاءِ، سُبْحَانَ اللّٰهِ مِلْءَ مَا فِی الْأَرْض وَ السَّماء، سُبْحَانَ اللّٰهِ عَدَدَ مَا أَحْصَى كِتَابَهُ، و سُبْحَانَ اللّٰهِ مِلْءَ مَا أَحْصَى كِتَابَهُ، سُبْحَانَ اللّٰهِ عَدَدَ كُلِّ شَیْءٍ، سُبْحَانَ اللّٰهِ مِلْءَ كُلِّ شَیْءٍ، اَلْحَمْدُ لِلّٰهِ عَدَدَ مَا خَلَقَ، اَلْحَمْدُ لِلّٰهِ مِلْءَ مَا خَلَقَ، وَ الْحَمْدُ لِلّٰهِ عَدَدَ مَا فِی الْأَرْضِ وَالسَّمَاءِ ، وَ الْحَمْدُ لِلّٰهِ مِلْءَ مَا فِی الْأَرْض وَ السَّماء، وَ الْحَمْدُ لِلّٰهِ عَدَدَ مَا أَحْصَى كِتَابَهُ، و الْحَمْدُ لِلّٰهِ مِلْءَ مَا أَحْصَى كِتَابَهُ، وَ الْحَمْدُ لِلّٰهِ كُلِّ شَیْءٍ، وَالْحَمْدُ لِلّٰهِ مِلْءَ كُلِّ شَیْءٍ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'فَسُبۡحٰنَ اللّٰهِ حِيۡنَ تُمۡسُوۡنَ وَحِيۡنَ تُصۡبِحُوۡنَ ۞ وَلَـهُ الۡحَمۡدُ فِىۡ السَّمٰوٰتِ وَالۡاَرۡضِ وَعَشِيًّا وَّحِيۡنَ تُظۡهِرُوۡنَ ۞ يُخۡرِجُ الۡحَـىَّ مِنَ الۡمَيِّتِ وَيُخۡرِجُ الۡمَيِّتَ مِنَ الۡحَـىِّ وَيُحۡىِ الۡاَرۡضَ بَعۡدَ مَوۡتِهَا ‌ؕ وَكَذٰلِكَ تُخۡرَجُوۡنَ ۞',
      'times': '1',
      'description': ''
    },
    {
      'dua': 'اَعُوْذُ بِاللّٰهِ السَّمِیْعِ الْعَلِیْمِ مِنَ الشَّیْطٰنِ الرَّجِیْم',
      'times': '3',
      'description': ''
    },
    {
      'dua':
          'هُوَ اللّٰهُ الَّذِیْ لَاۤ اِلٰهَ اِلَّا هُوَۚ عٰلِمُ الْغَیْبِ وَ الشَّهَادَةِۚ هُوَ الرَّحْمٰنُ الرَّحِیْمُ ۞ هُوَ اللّٰهُ الَّذِیْ لَاۤ اِلٰهَ اِلَّا هُوَۚ اَلْمَلِكُ الْقُدُّوْسُ السَّلٰمُ الْمُؤْمِنُ الْمُهَیْمِنُ الْعَزِیْزُ الْجَبَّارُ الْمُتَكَبِّرُؕ سُبْحٰنَ اللّٰهِ عَمَّا یُشْرِكُوْنَ ۞ هُوَ اللّٰهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْاَسْمَآءُ الْحُسْنٰىؕ یُسَبِّحُ لَهٗ مَا فِی السَّمٰوٰتِ وَ الْاَرْضِۚ وَ هُوَ الْعَزِیْزُ الْحَکِیْمُ ۞',
      'times': '1',
      'description': ''
    },
  ];
  duaMap['maghrib'] = [
    {
      'dua':
          'بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ\nقُلْ هُوَ اللّٰهُ اَحَدٌ ۞ اَللّٰهُ الصَّمَدُ ۞ لَمْ يَلِدْ وَلَمْ يُوْلَدْ ۞ وَلَمْ يَكُنْ لَّهُ كُفُوًا اَحَدٌ ۞\n\nبِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ\nقُلْ اَعُوْذُ بِرَبِّ الْفَلَقِ ۞ مِنْ شَرِّ مَا خَلَقَ ۞ وَمِنْ شَرِّ غَاسِقٍ اِذَا وَقَبَ ۞ وَمِنْ شَرِّ النَّفّٰثٰتِ فِى الْعُقَدِ ۞ وَمِنْ شَرِّ حَاسِدٍ اِذَا حَسَدَ ۞\n\nبِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ\nقُلْ اَعُوْذُ بِرَبِّ النَّاسِ ۞ مَلِكِ النَّاسِ ۞ اِلٰهِ النَّاسِ ۞ مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ۞ اَلَّذِىْ يُوَسْوِسُ فِىْ صُدُوْرِ النَّاسِ ۞ مِنَ الْجِنَّةِ وَالنَّاسِ ۞',
      'times': '3',
      'description': ''
    },
    {
      'dua':
          'حَسْبِـیَ اللّٰهُ لَا إلٰهَ إلَّا هُوَ عَلَيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم',
      'times': '7',
      'description': 'مذکورہ دعا چاہے سچے دل سے پڑھے یا جھوٹے دل سے پڑھے پریشانی دور ہو گی'
    },
    {
      'dua':
          'اللّٰهُمَّ اِنِّي اَمْسَیْتُ اُشْهِدُكَ ، وَاُشْهِدُ حَمَلَةَ عَرْشِكَ وَمَلَائِكَتَكَ وَجَمِيعَ خَلْقِكَ ، اَنَّكَ َنْتَ اللّٰهُ ، لَا اِلَهَ اِلَّا اَنْتَ ، وَحْدَكَ لَا شَرِيكَ لَكَ ، وَاَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ',
      'times': '4',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ اِنِّی اَمْسَیْتُ مِنْكَ فِي نِعْمَةٍ وَعَافِيَةٍ وَسِتْرٍ؛ فَاَتْمِمْ عَلَيَّ نِعْمَتَكَ وَعَافِيَتَكَ وَسِتْرَكَ فِي الدُّنْيَا وَالْآخِرَةِ',
      'times': '3',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ مَا اَمْسٰی بِی مِـنْ نِعْمَةٍ اَو باَحَدٍ مِـنْ خَلْقِك ، فَمِنْكَ وَحْـدَكَ لَا شَرِيْكََ لَكَ ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْر',
      'times': '1',
      'description': ''
    },
    {'dua': 'اللّٰھُمَّ اَجِرْنِیْ مِنَ النَّارِ', 'times': '7', 'description': ''},
    {
      'dua': 'یَا رَبِّ لَكَ الْحَمْدَ کَمَا یَنْبَغِیْ لِجَلَالِ وَجْهِكَ وَ عَظِیْمِ سُلْطَانِكَ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ ھَذٰآ اِقْبَالُ لَیْلِكَ وَ اِدْبَارُ نَھَارِكَ وَاَصْوَاتُ دُعَاتِكَ فَاغْفِرْلِی',
      'times': '1',
      'description': 'نیچے والی دعا مغرب کی اذانوں کے وقت پڑھ لیجئے'
    },
    {
      'dua':
          'اَللّٰھُمَّ اَنْتَ خَلَقْتَنِیْ، وَاَنْتَ تَھْدِیْنِیْ، وَاَنْتَ تُطْعِمُنِیْ، وَاَنْتَ تَسْقِیْنِیْ، وَاَنْتَ تُمِیْتُنِیْ ، وَاَنْتَ تُحْیِیْنِیْ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَعُوْذُ بِوَجْهِ اللّٰهِ الْکَرِیْمِ، وَبِکَلِمَاتِ اللّٰهِ التَّآمَّآتِ الَّتِیْ لَاَیُجَاوِزُھُنَّ بَرٌّ وَّلَاَ فَاجِرٌ مِنْ شَرِّ مَا یَنْزِلُ مِنَ السَّمَآءِ وَمِنْ شَرِّ مَا یَعْرُجُ فِیْھَا، وَ شَرِّ مَا ذَرَأ فِیْ الْاَرْضِ، وَ شَرِّ مَا یَخْرُجُ مِنْھَا، وَمِنْ فِتَنِ الَّلیْلِ وَالنَّھَارِ، وَمِنْ طَوَارِقِ اللَّیْلِ وَالنَّھَارِ اِلَّا طَارِقًا یَّطْرِقُ بِخَیْرٍ یَارَحْمٰنُ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَمْسَیْنَا وَ اَمْسَی المُلْكُ لِلّٰهِ وَالْحَمْدُ کُلُّهٗ لِلّٰهِ اَعُوْذُ بِاللّٰهِ الَّذِی یُمْسِكُ السَّمآءَ اَنْ تَقَعَ عَلٰی الْاَرْضِ اِلَّا بِاِذْنِهِ مِنْ شَرِّ مَا خَلَقَ وَ ذَرَأَ وَ مِنْ شَرِّ الشَّیْطَانِ وَ شِرْکِهٖ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَعُوذُ بِوَجْهِ اللّٰهِ الْعَظِیمِ، الَّذِی لَیْسَ شَیْءٌ اَعْظَمَ مِنْهُ، وَبِکَلِمَاتِ اللّٰهِ التَّامَّاتِ، الَّتِی لَا یُجَاوِزُهُنَّ بَرٌّ وَلاَ فَاجِرٌ، وَبِاَسْمَاء ِ اللّٰهِ الْحُسْنَی کُلِّها, مَا عَلِمْتُ مِنْها وَمَا لَمْ اَعْلَمْ، مِنْ شَرِّ مَا خَلَقَ وَبَرَاَ وَذَرَاَ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ اِنِّي اَسْاَلُك مِن فُجَاءَةِ الخَيِرِ وَاَعُوْذُ بِكَ مِنْ فُجَاءَةِ الشَّرِّ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَمْسَیْنَا وَاَمْسَی الْمُلْكُ لِلّٰهِ رَبِّ الْعَالَمِیْنَ اَللّٰھُمَّ اِنِّیْ اَسْأَلُك خَیْرَ ھٰذَہ اللَّیْلَةِ وَفَتْحَھَا وَنَصْرَھَا وَ بَرَکَتَھَا وَ ھُدَاھَا وَاَعُوْذُبِكَ مَنْ شَرِّ مَا فِیْھَا وَشَرِّ مَا بَعْدَھَا',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَمْسَیْنَا عَلٰی فِطْرَۃِ الْاِسْلَامِ وَ کَلِمَةِ الْاِخْلَاصِ وَعَلٰی دِینِ نَبِیِّنَا مُحَمَّدٍ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ وَعَلٰی مِلَّةِ اَبِیْنَا اِبْرَاہِیمَ حَنِیفًا مُسْلِمًا وَمَا کَانَ مِنَ الْمُشْرِکِینَ',
      'times': '1',
      'description': ''
    },
  ];
  duaMap['isha'] = [
    {
      'dua': 'اَعُوْذُ بِکَلِمَاتِ اللّٰهِ التَّآمَّاتِ مِنْ شَرِّ مَا خَلَقَ',
      'times': '3',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ الۡحَىُّ الۡقَيُّوۡمُۚ لَا تَاۡخُذُهٗ سِنَةٌ وَّلَا نَوۡمٌ‌ؕ لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ‌ؕ مَنۡ ذَا الَّذِىۡ يَشۡفَعُ عِنۡدَهٗۤ اِلَّا بِاِذۡنِهٖ‌ؕ يَعۡلَمُ مَا بَيۡنَ اَيۡدِيۡهِمۡ وَمَا خَلۡفَهُمۡ‌ۚ وَلَا يُحِيۡطُوۡنَ بِشَىۡءٍ مِّنۡ عِلۡمِهٖۤ اِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرۡسِيُّهُ السَّمٰوٰتِ وَالۡاَرۡضَ‌‌ۚ وَلَا يَــئُوۡدُهٗ حِفۡظُهُمَا ‌ۚ وَ هُوَ الۡعَلِىُّ الۡعَظِيۡمُ ۞',
      'times': '1',
      'description': 'آیۃ الکرسی پڑھ کر پھر سورہ مومن کی نیچے والی تین آیتیں صبح کے وقت پڑھ لیں'
    },
    {
      'dua':
          'حَمٓ ۞ تَنۡزِيۡلُ الۡكِتٰبِ مِنَ اللّٰهِ الۡعَزِيۡزِ الۡعَلِيۡمِۙ ۞ غَافِرِ الذَّنۡۢبِ وَقَابِلِ التَّوۡبِ شَدِيۡدِ الۡعِقَابِ ذِى الطَّوۡلِؕ لَاۤ اِلٰهَ اِلَّا هُوَؕ اِلَيۡهِ الۡمَصِيۡرُ ۞',
      'times': '1',
      'description': 'آیۃ الکرسی پڑھ کر پھر سورہ مومن کی نیچے والی تین آیتیں صبح کے وقت پڑھ لیں'
    },
    {
      'dua':
          'اَفَحَسِبۡتُمۡ اَنَّمَا خَلَقۡنٰكُمۡ عَبَثًا وَّاَنَّكُمۡ اِلَيۡنَا لَا تُرۡجَعُوۡنَ ۞ فَتَعٰلَى اللّٰهُ الۡمَلِكُ الۡحَـقُّ‌ ۚ لَاۤ اِلٰهَ اِلَّا هُوَ‌ۚ رَبُّ الۡعَرۡشِ الۡـكَرِيۡمِ ۞ وَمَنۡ يَّدۡعُ مَعَ اللّٰهِ اِلٰهًا اٰخَرَۙ لَا بُرۡهَانَ لَهٗ بِهٖۙ فَاِنَّمَا حِسَابُهٗ عِنۡدَ رَبِّهٖؕ اِنَّهٗ لَا يُفۡلِحُ الۡـكٰفِرُوۡنَ ۞ وَقُلْ رَّبِّ اغۡفِرۡ وَارۡحَمۡ وَاَنۡتَ خَيۡرُ الرّٰحِمِيۡن ۞',
      'times': '1',
      'description': ''
    },
    {'dua': 'منجیات', 'times': '1', 'description': ''},
    {
      'dua':
          'اَللّٰھُمَّ اغْفِرْلِیْ وَلِلْمُؤْمِنِیْنَ وَالْمُؤْمِنَاتِ وَالْمُسْلِمِیْنَ وَالْمُسْلِمَاتِ',
      'times': '25 یا 27',
      'description': ''
    },
    {
      'dua':
          'اَللّٰهُ اَکْبَرُ کَبِیْرًا، وَالْحَمْدُ لِلّٰهِ کَثِیْرًا، وَّسُبْحَانَ اللّٰهِ بُکْرَۃً وَّاَصِیْلاً',
      'times': '1',
      'description': ''
    },
    {'dua': 'اَعُوذُ بِاللّٰهِ مِنَ الشَّيْطَانِ الرَّجِيمِ', 'times': '10', 'description': ''},
    {
      'dua':
          'اَللّٰھُمَّ صَلِّ عَلٰی مُحَمَّدٍ عَبْدِكَ وَرَسُوْلِكَ وَ عَلٰی الْمُؤمِنِیْنَ وَالْمُؤمِنَاتِ وَالْمُسْلِمِیْنَ وَالْمُسْلِمَاتِ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَللّٰھُمَّ لَكَ الْحَمْدُ کَمَا اَنْتَ اَھْلُهُ فَصَلِّ وَ سَلِّمْ عَلٰی سَیَّدِنَا مُحَمَّدٍ کَمَا اَنتَ اَھلُهُ وَافْعَل بِنَا مَآ اَنْتَ اَھْلُهُ فَاِنَّكَ اَھْلُ التَّقوٰی وَاَھْلُ الْمَغفِرَةِ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ مَغْفِرَتِكَ اَوْسَعُ مِنْ ذُنُوبِیْ وَرَحْمَتُكَ اَرْجٰى عِنْدِی مِنْ عَمَلِیْ',
      'times': '3',
      'description': ''
    },
    {
      'dua':
          'تَوَكَّلْتُ عَلَى الْحَیِّ الَّذِیْ لَا یَمُوْتُ اَلْحَمْدُ لِلّٰهِ الَّذِیْ لَمْ یَتَّخِذْ وَلَدًا وَّ لَمْ یَكُنْ لَّهٗ شَرِیْكٌ فِی الْمُلْكِ وَ لَمْ یَكُنْ لَّهٗ وَلِیٌّ مِّنَ الذُّلِّ وَ كَبِّرْهُ تَكْبِیْرًا',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ\nقُلْ هُوَ اللّٰهُ اَحَدٌ ۞ اَللّٰهُ الصَّمَدُ ۞ لَمْ يَلِدْ وَلَمْ يُوْلَدْ ۞ وَلَمْ يَكُنْ لَّهُ كُفُوًا اَحَدٌ ۞',
      'times': '10',
      'description': ''
    },
  ];

  for (int x = 0; x < headingList!.length; x++) {
    duaMap[prayerTime]![x]['heading'] = headingList[x][languageSelected]!;
  }

  return duaMap[prayerTime];
}
