import 'package:flutter/material.dart';
import 'package:intl/intl.dart';

DateFormat namazTimeFormat = DateFormat.jm(DateFormat('hh:mm a'));

const String fontFamily = 'DMSans';

double getHeight(BuildContext context) {
  return MediaQuery.of(context).size.height;
}

double getWidth(BuildContext context) {
  return MediaQuery.of(context).size.width;
}

nextScreen(BuildContext context, Widget page) {
  Navigator.push(context, MaterialPageRoute(builder: (context) => page));
}

TimeOfDay getTimeFormat(String s) {
  TimeOfDay formatedTime = TimeOfDay(hour: int.parse(s.split(":")[0]), minute: int.parse(s.split(":")[1]));
  return formatedTime;
}

int timeInMiliseconds(String s) {
  var form = Duration(hours: int.parse(s.split(":")[0]), minutes: int.parse(s.split(":")[1]));
  return form.inMilliseconds;
}

// "9:30";
// "15:30"
// "18:30"
int getNotificationDate(String s, int day) {
  var d = DateTime.now();
  var date;
  if (d.day == getDaysInMonth()) {
    date = DateTime(d.year, d.month + 1, day, int.parse(s.split(":")[0]), int.parse(s.split(":")[1]));
  } else {
    date = DateTime(d.year, d.month, d.day + day, int.parse(s.split(":")[0]), int.parse(s.split(":")[1]));
  }
  return date.millisecondsSinceEpoch;
}

int getDaysInMonth() {
  var d = DateTime.now();
  if (d.month == DateTime.february) {
    final bool isLeapYear = (d.year % 4 == 0) && (d.year % 100 != 0) || (d.year % 400 == 0);
    return isLeapYear ? 29 : 28;
  }
  const List<int> daysInMonth = <int>[31, -1, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
  return daysInMonth[d.month - 1];
}

List<Map<String, String>>? getHeading(String prayerTimings) {
  Map<String, List<Map<String, String>>> duaMap = {};
  duaMap['fajar'] = [
    {'en': 'The Prophetic prescription to be sufficient from everything.', 'ur': 'ہر چیز سے کفایت کا نبوی نسخہ'},
    {
      'en': 'The Prophetic prescription to be sufficient from everything of this world and the next.',
      'ur': 'دنیا و آخرت کے کاموں پر کفایت کا نبوی نسخہ'
    },
    {'en': 'The Prophetic prescription for freedom from Hellfire.', 'ur': 'جہنم سے برأت کا نبوی نسخہ'},
    {
      'en': 'The Prophetic prescription to attain the complete blessings of Allah (SWT).',
      'ur': 'اپنے لیے اللّٰہ تعالی کی نعمتوں کو مکمل فرمانے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for being thankful for all the blessings attained day and night.',
      'ur': 'دن اور رات کی نعمتوں کا شکر ادا کرنے کا نبوی نسخہ'
    },
    {'en': 'The Prophetic prescription for attaining God’s pleasure.', 'ur': 'رضائے الٰہی حاصل کرنے کا نبوی نسخہ'},
    {
      'en': 'The Prophetic prescription for protection from the whispers of the Devil.',
      'ur': 'وساوسِ شیطان سے حفاظت کا نبوی نسخہ'
    },
    {'en': 'The Prophetic prescription for good (safety) in everything.', 'ur': 'ہر قسم کی عافیت کا نبوی نسخہ'},
    {
      'en': 'The Prophetic prescription for the removal of sadness/depression and the payment of debts.',
      'ur': 'زوالِ غم اور ادائیگی قرض کا نبوی نسخہ'
    },
    {'en': 'The Prophetic prescription for saviour from Hell fire.', 'ur': 'جہنم سے خلاصی پانے کا نبوی نسخہ'},
    {
      'en': 'The Prophetic prescription for protection from harms and witchcraft etc.',
      'ur': 'آسیب و سحر وغیرہ سے حفاظت کا نبوی نسخہ'
    },
    {
      'en': 'An easy Prophetic prescription to be safe from 3 major illnesses. 1',
      'ur': 'تین بڑی بیماریوں سے بچنے کا نبوی آسان نسخہ1'
    },
    {
      'en': 'An easy Prophetic prescription to be safe from 3 major illnesses. 2',
      'ur': 'تین بڑی بیماریوں سے بچنے کا نبوی آسان نسخہ2'
    },
    {
      'en': 'The Prophetic prescription for protection from the mischief of the Jinns.',
      'ur': 'جنات کی شرارت سے بچنے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection from the mischief of the Jinns.',
      'ur': 'جنات کی شرارت سے بچنے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection from the mischief of the Jinns.',
      'ur': 'جنات کی شرارت سے بچنے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection from the mischief of the Jinns.',
      'ur': 'جنات کی شرارت سے بچنے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection from the mischief of the Jinns.',
      'ur': 'جنات کی شرارت سے بچنے کا نبوی نسخہ'
    },
  ];
  duaMap['zuhur'] = [
    {
      'en': 'The Prophetic prescription asking for the blessings of this world and the hereafter.',
      'ur': 'دنیا و آخرت کی بھلائیاں مانگ لینے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection against sudden calamities',
      'ur': 'ناگہانی مصیبت سے بچاؤ کا نبوی نسخہ'
    },
    {'en': 'When waiting for some news.', 'ur': 'جب کسی خبر کا انتظار ہو'},
    {
      'en': 'The Prophetic prescription for describing the purity and praise of Allah (SWT).',
      'ur': 'اللّٰہ کی پاکی اور حمد بیان کرنے کا نبوی نسخہ'
    },
    {'en': 'The Prophetic prescription for the health of the body.', 'ur': 'بدن کی عافیت کا نبوی نسخہ'},
    {'en': 'The prophetic prescription for entrance into Paradise.', 'ur': 'جنت میں داخل ہونے کا نبوی نسخہ'},
    {
      'en': 'The Prophetic prescription for gaining beneficial knowledge and halal sustenance.',
      'ur': 'علم نافع اور رزق حلال ملنے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription of taking reward from Allah according to His glory.',
      'ur': 'اللّٰہ سے اس کی شان کے مطابق اجر لینے کا نبوی نسخہ'
    },
    {'en': 'The Prophetic prescription for saviour from sufferings.', 'ur': 'مصیبتوں سے نجات حاصل کرنے کا نبوی نسخہ'},
    {
      'en': 'The Prophetic prescription for gaining great sustenance and being protected from all forms of evil.',
      'ur': 'بہترین رزق پانے کا اور برائیوں سے محفوظ رہنے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for the compensation of lack of dhikr (remembrance of Allah (SWT)).',
      'ur': 'ذکر کے معمولات کی کمی کی تلافی کا نبوی نسخہ'
    },
    {'en': 'The Prophetic prescription for protection from every calamity. 1', 'ur': 'ہر بلا سے حفاظت کا نبوی نسخہ1'},
    {'en': 'The Prophetic prescription for protection from every calamity. 2', 'ur': 'ہر بلا سے حفاظت کا نبوی نسخہ2'},
    {
      'en':
          'The Prophetic prescription for being deserving of the prayers of the angels and to attain the reward of a martyr at the time of death. 1',
      'ur': 'فرشتوں کی دعاؤں کے مستحق بننے کا اور موت پر شہادت کا اجر ملنے کا نبوی نسخہ1',
    },
    {
      'en':
          'The Prophetic prescription for being deserving of the prayers of the angels and to attain the reward of a martyr at the time of death. 2',
      'ur': 'فرشتوں کی دعاؤں کے مستحق بننے کا اور موت پر شہادت کا اجر ملنے کا نبوی نسخہ2',
    },
    {
      'en': 'The Prophetic prescription for the fulfilment of all requests.',
      'ur': 'سارے مطالبوں کے پورا ہونے کا نبوی نسخہ',
    },
    {
      'en': 'Five statements for the hereafter.',
      'ur': 'پانچ جملے آخرت کے لیے',
    },
    {
      'en': 'There will be a lot of benefit.',
      'ur': 'بہت بہت فائدہ ہو گا',
    },
  ];
  duaMap['asr'] = [
    {
      'en': 'The Prophetic prescription to be in the protection of Allah (SWT) and keep the devil away.',
      'ur': 'اللّٰہ کی حفاظت میں آنے اور شیطان کے دور ہونے کا نبوی نسخہ'
    },
    {'en': 'The Prophetic prescription for self-sufficiency.', 'ur': 'اپنی کفایت کا نبوی نسخہ'},
    {
      'en': 'The Prophetic prescription that will please the slave on the Day of Judgement.',
      'ur': 'قیامت کے دن بندہ کو راضی کیے جانے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection against sudden calamities.',
      'ur': 'ناگہانی آفتوں سے حفاظت کا نبوی نسخہ'
    },
    {'en': 'The Prophetic prescription for the health of the body.', 'ur': 'بدن کی عافیت کا نبوی نسخہ'},
    {
      'en': 'The Prophetic prescription for protection from the whispers of the Devil.',
      'ur': 'وساوس شیطان سے حفاظت کا نبوی نسخہ'
    },
    {'en': 'The prophetic prescription for entrance into Paradise.', 'ur': 'جنت میں داخل ہونے کا نبوی نسخہ'},
    {
      'en': 'The Prophetic prescription for the removal of sadness/ depression and the payment of debts.',
      'ur': 'زوالِ غم اور ادائیگی قرض کا نبوی نسخہ'
    },
    {'en': 'The Prophetic prescription for the protection against calamities.', 'ur': 'مصیبت سے بچاؤ کا نبوی نسخہ'},
    {
      'en': 'Recite this dua once and have the whole family recite it too',
      'ur': 'یہ دعا خود بھی پڑھیں اور اہل خانہ سے بھی پڑھوائیں'
    },
    {
      'en': 'The Prophetic prescription for the compensation of lack of dhikr (remembrance of Allah (SWT)).',
      'ur': 'ذکر کے معمولات کی کمی کی تلافی کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for the compensation of lack of dhikr (remembrance of Allah (SWT)). 1',
      'ur': '1فرشتوں کی دعاؤں کے مستحق بننے کا اور موت پر شہادت کا اجر ملنے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for the compensation of lack of dhikr (remembrance of Allah (SWT)). 2',
      'ur': '2فرشتوں کی دعاؤں کے مستحق بننے کا اور موت پر شہادت کا اجر ملنے کا نبوی نسخہ'
    },
  ];
  duaMap['maghrib'] = [
    {
      'en': 'The Prophetic prescription for protection against every evil.',
      'ur': 'ہر موذی کے شر سے حفاظت کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription to be sufficient from everything of this world and the next.',
      'ur': 'دنیا و آخرت کے کاموں پر کفایت کا نبوی نسخہ'
    },
    {'en': 'The Prophetic prescription for freedman from Hellfire.', 'ur': 'جہنم سے آزادی پانے کا نبوی نسخہ'},
    {
      'en': 'The Prophetic prescription to declare having all the blessings bestowed on you by Allah (SWT).',
      'ur': 'اپنے لیے اللّٰہ تعالی کی نعمتوں کو مکمل کروانے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for being thankful for all the blessings one has been bestowed with.',
      'ur': 'نعمتوں کی ادائیگیِ شکر کا نبوی نسخہ'
    },
    {'en': 'The Prophetic prescription for saviour from Hell fire.', 'ur': 'جہنم سے حفاظت کا نبوی نسخہ'},
    {
      'en': 'The Prophetic prescription of taking reward from Allah according to His glory.',
      'ur': 'اللّٰہ سے اس کی شان کے مطابق اجر لینے کا نبوی نسخہ'
    },
    {'en': 'The Prophetic prescription for seeking Allah’s forgiveness.', 'ur': 'اللّٰہ سے بخشش طلب کرنے کا نبوی نسخہ'},
    {
      'en': 'The Prophetic prescription for the fulfilment of all requests.',
      'ur': 'ساری مرادیں پوری کیے جانے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection from the mischief of the Jinns.',
      'ur': 'جنات کی شرارت سے بچنے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription for protection from harms and witchcraft etc.',
      'ur': 'آسیب و سحر وغیرہ سے حفاظت کا نبوی نسخہ'
    },
    {'en': 'An important prescription for protection against magic.', 'ur': 'جادو سے حفاظت کا اہم نسخہ'},
    {'en': 'When waiting for some news.', 'ur': 'جب کسی خبر کا انتظار ہو'},
    {
      'en': 'The Prophetic prescription for protection from the mischief of the Jinns.',
      'ur': 'جنات کی شرارت سے بچنے کا نبوی نسخہ'
    },
  ];
  duaMap['isha'] = [
    {
      'en': 'The Prophetic prescription for protection from every harmful animal.',
      'ur': 'ہر موذی جانور سے حفاظت کا نبوی نسخہ'
    },
    {'en': 'The Prophetic prescription for protection from every calamity. 1', 'ur': 'ہر بلا سے حفاظت کا نبوی نسخہ1'},
    {'en': 'The Prophetic prescription for protection from every calamity. 2', 'ur': 'ہر بلا سے حفاظت کا نبوی نسخہ2'},
    {'en': 'During the evening.', 'ur': 'منجیات'},
    {
      'en': 'The Prophetic prescription for opening the doors of the Heavens.',
      'ur': 'آسمان کے دروازے کھلوانے کا نبوی نسخہ'
    },
    {
      'en': 'The Prophetic prescription. For protection against the evil of the Devil.',
      'ur': 'شیطان کے شر سے بچنے کا نبوی نسخہ'
    },
    {'en': 'Remedy for increase in wealth.', 'ur': 'مال و مَنال میں اضافہ کا ایک نسخہ'},
    {
      'en': 'To praise (Allah SWT) and send salutations (on the Prophet (SAW)) in the best way.',
      'ur': 'حمد و درود بہترین انداز میں'
    },
    {'en': 'Remedy for the forgiveness of all sins.', 'ur': 'سارے گناہ معاف کروانے کا نسخہ'},
    {
      'en': 'The Prophetic prescription to remove illness and poverty.',
      'ur': 'بیماری اور تنگدستی دور کرنے کا نبوی نسخہ'
    },
    {'en': 'Remedy to protect oneself from sin all day', 'ur': 'سارا دن گناہوں سے بچنے کا اہم نسخہ'},
  ];
  return duaMap[prayerTimings];
}

List<Map<String, String>>? getDuaMap(String prayerTime, String languageSelected) {
  var headingList = getHeading(prayerTime);
  Map<String, List<Map<String, String>>> duaMap = {};
  duaMap['fajar'] = [
    {
      'dua':
          'بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ\nقُلْ هُوَ اللّٰهُ اَحَدٌ ۞ اَللّٰهُ الصَّمَدُ ۞ لَمْ يَلِدْ وَلَمْ يُوْلَدْ ۞ وَلَمْ يَكُنْ لَّهُ كُفُوًا اَحَدٌ ۞\n\nبِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ\nقُلْ اَعُوْذُ بِرَبِّ الْفَلَقِ ۞ مِنْ شَرِّ مَا خَلَقَ ۞ وَمِنْ شَرِّ غَاسِقٍ اِذَا وَقَبَ ۞ وَمِنْ شَرِّ النَّفّٰثٰتِ فِى الْعُقَدِ ۞ وَمِنْ شَرِّ حَاسِدٍ اِذَا حَسَدَ ۞\n\nبِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ\nقُلْ اَعُوْذُ بِرَبِّ النَّاسِ ۞ مَلِكِ النَّاسِ ۞ اِلٰهِ النَّاسِ ۞ مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ۞ اَلَّذِىْ يُوَسْوِسُ فِىْ صُدُوْرِ النَّاسِ ۞ مِنَ الْجِنَّةِ وَالنَّاسِ ۞',
      'times': '3',
      'description': ''
    },
    {
      'dua': 'حَسْبِـيَ اللّٰهُ لَآ إلٰهَ إلَّا هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم',
      'times': '7',
      'description': 'مذکورہ دعا چاہے سچے دل سے پڑھے یا جھوٹے دل سے پڑھے پریشانی دور ہو گی'
    },
    {
      'dua':
          'اللّٰهُمَّ اِنِّی اَصْبَحْتُ اُشْهِدُكَ ، وَاُشْهِدُ حَمَلَةَ عَرْشِكَ وَمَلَائِكَتَكَ وَجَمِيعَ خَلْقِكَ ، اَنَّكَ اَنْتَ اللّٰهُ ، لَا اِلَهَ اِلَّا اَنْتَ ، وَحْدَكَ لَا شَرِيكَ لَكَ ، وَاَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ',
      'times': '4',
      'description': '',
    },
    {
      'dua':
          'اللّٰهُمَّ اِنِّی اَصْبَحْتُ مِنْكَ فِي نِعْمَةٍ وَعَافِيَةٍ وَسِتْرٍ؛ فَاَتْمِمْ عَلَيَّ نِعْمَتَكَ وَعَافِيَتَكَ وَسِتْرَكَ فِي الدُّنْيَا وَالْآخِرَةِ',
      'times': '3',
      'description': '',
    },
    {
      'dua':
          'اللّٰهُمَّ مَا اَصْبَـَحَ بِي مِـنْ نِعْمَةٍ أَو باَحَدٍ مِـنْ خَلْقِك ، فَمِنْكَ وَحْـدَكَ لَا شَرِيْكََ لَكَ ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْر',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'رَضِيْتُ بِاللّٰهِ رَبًّا ، وَبِالْاِسْلَامِ دِينًا ، وَبِمُحَمَّدٍ صَلَّی اللّٰهُ عَلَیْهِ وَسَلَّمَ نَبِيًّا',
      'times': '3',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ فَاطِرَ السَّمَوَاتِ وَالاَرْضِ عَالِمَ الغَيْبِ وَالشَّهَادةِ، رَبَّ كُلِّ شَيءٍ وَمَلِيكَهُ، اَشْهَدُ اَنْ لَا اِلٰهَ اِلاَّ اَنْتَ، اَعُوذُبِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ وَ اَنْ اَقْتَرِفَ عَلٰی نَفْسِی سُوْٓءً اَوْ اَجُرَّہُ اِلٰی مُسْلِمٕ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ اِنِّي اَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْیَا وَالْاَخِرَۃِ اللّٰهُمَّ اِنِّي اَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِی دِينِی وَدُنْيَايَ وَاَهْلِی وَمَالِی ، اللّٰهُمَّ اسْتُرْ عَوْرَاتِی وَآمِنْ رَوْعَاتِی ، اللّٰهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَّمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي وَاَعُوذُ بِعَظَمَتِكَ اَنْ اُغْتَالَ مِنْ تَحْتِي',
      'times': '1',
      'description': '',
    },
    {
      'dua':
          'اللّٰهُمَّ اِنِّی اَعُوذُبِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَاَعُوذُبِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَاَعُوذُبِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَاَعُوذُبِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ',
      'times': '1',
      'description': ''
    },
    {'dua': 'اللّٰھُمَّ اَجِرْنِیْ مِنَ النَّارِ', 'times': '7', 'description': ''},
    {
      'dua':
          'اَعُوذُ بِوَجْهِ اللّٰهِ الْعَظِیمِ، الَّذِی لَیْسَ شَیْءٌ اَعْظَمَ مِنْهُ، وَبِکَلِمَاتِ اللّٰهِ التَّامَّاتِ، الَّتِی لَا یُجَاوِزُهُنَّ بَرٌّ وَلاَ فَاجِرٌ، وَبِاَسْمَاء ِ اللّٰهِ الْحُسْنٰی کُلِّها, مَا عَلِمْتُ مِنْها وَمَا لَمْ اَعْلَمْ، مِنْ شَرِّ مَا خَلَقَ وَبَرَاَ وَذَرَاَ',
      'times': '1',
      'description': ''
    },
    {'dua': 'سُبْحَانَ اللّٰهِ الْعَظِیْمِ وَبِحَمْدِہٖ', 'times': '3', 'description': ''},
    {
      'dua':
          'اَللّٰهُمَّ اِنِّیْ اَسْئَلُك مِمَّا عِنْدَك وَاَفِضْ عَلَیَّ مِنْ فَضْلِكَ وَانْشُرْ عَلَیَّ مِنْ بَرَکَاتِكَ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَفَحَسِبۡتُمۡ اَنَّمَا خَلَقۡنٰكُمۡ عَبَثًا وَّاَنَّكُمۡ اِلَيۡنَا لَا تُرۡجَعُوۡنَ ۞ فَتَعٰلَى اللّٰهُ الۡمَلِكُ الۡحَـقُّ‌ ۚ لَاۤ اِلٰهَ اِلَّا هُوَ‌ۚ رَبُّ الۡعَرۡشِ الۡـكَرِيۡمِ ۞ وَمَنۡ يَّدۡعُ مَعَ اللّٰهِ اِلٰهًا اٰخَرَۙ لَا بُرۡهَانَ لَهٗ بِهٖۙ فَاِنَّمَا حِسَابُهٗ عِنۡدَ رَبِّهٖؕ اِنَّهٗ لَا يُفۡلِحُ الۡـكٰفِرُوۡنَ ۞ وَقُلْ رَّبِّ اغۡفِرۡ وَارۡحَمۡ وَاَنۡتَ خَيۡرُ الرّٰحِمِيۡن ۞',
      'times': '1',
      'description': ''
    },
    {
      'dua': 'اللّٰهُمَّ بِكَ اَصْبَحْنَا وَبِكَ اَمْسَيْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَاِلَيْكَ النُّشُورُ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَصْبَحْنَا وَاَصْبَحَ الْمُلْکُ لِلّٰهِ رَبِّ الْعَالَمِیْنَ اَللّٰھُمَّ اِنِّیْ اَسْأَلُك خَیْرَ ھٰذَا الْیَوْمِ وَفَتْحَهُ وَنَصْرَہ وَ بَرَکَتَهُ وَ ھُدَاہُ وَاَعُوْذُبِكَ مَنْ شَرِّ مَا فِیْهِ وَشَرِّ مَا بَعْدَہ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اللّٰھُمَّ اجْعَلْ اَوَّلَ ھَذَا النَھَارِ صَلَاحًا وَاَوْسَطَهُ فَلَاحًا وآخِرَہُ نجَاحًا وَاَسْاَلُكَ خَیْرَ الدُّنْیَا وَ الْآخِرَةِ یَا اَرْحَمَ الرَّاحِمِیْن',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَصْبَحْنَا عَلٰی فِطْرَۃِ الْاِسْلَامِ وَ کَلِمَةِ الْاِخْلَاصِ وَعَلٰی دِینِ نَبِیِّنَا مُحَمَّدٍ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ وَعَلٰی مِلَّةِ اَبِیْنَا اِبْرَاہِیمَ حَنِیفًا مُسْلِمًا وَمَا کَانَ مِنَ الْمُشْرِکِینَ',
      'times': '1',
      'description': ''
    }
  ];
  duaMap['zuhur'] = [
    {
      'dua':
          'يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ اَسْتَغِيثُ، اَصْلِحْ لِي شَأْنِی كُلَّهُ، وَلَا تَكِلْنِی اِلَى نَفْسِی طَرَفَةَ عَيْنٍ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'بِسْمِ اللّٰهِ الَّذِی لَا يَضُرُّ مَعَ اسْمِهِ شَیْءٌ فِی الأرضِ وَلاَ فِی السَّمَاءِ وَهُوَ السَّمِيعُ العَلِيْمُ',
      'times': '3',
      'description': ''
    },
    {
      'dua': 'اللّٰهُمَّ اِنِّي اَسْاَلُك مِن فُجَآءَةِ الخَيِرِ وَاَعُوْذُ بِكَ مِنْ فُجَآءَةِ الشَّرِّ',
      'times': '1',
      'description': ''
    },
    {
      'dua': 'سُبْحَانَ اللّٰهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ',
      'times': '3',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ عَافِنِی فِي بَدَنِی اللّٰهُمَّ عَافِنِي فِی سَمْعِي اللّٰهُمَّ عَافِنِی فِی بَصَرِیْ لَا اِلَهَ اِلاَّ اَنْتَ اللّٰهُمَّ اِنِّي اَعُوذُبِكَ مِنَ الْكُفْرِ وَالفَقْرِ وَاَعُوذُبِكَ مِنْ عَذَابِ القَبْرِ لَا اِلَهَ اِلاَّ أَنْتَ',
      'times': '3',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ اَنْتَ رَبِّی لّا اِلَهَ اِلَّا أَنْتَ، خَلَقْتَنِیْ وَاَنَا عَبْدُكَ، وَاَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتَ، اَعُوذُبِكَ مِنْ شَرِّ مَا صَنَعْتَ، اَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَاَبُوءُ لَكَ بِذَنْبِیْ فَاغْفِر لِی فَاِنَّهُ لَا يَغْفِرُ الذُّنُوبَ اِلَّا أَنْتَ',
      'times': '1',
      'description': ''
    },
    {
      'heading': '',
      'dua': 'اللّٰهُمَّ اِنِّي اَسْأَلُكَ عِلْماً نَافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً',
      'times': '1',
      'description': ''
    },
    {
      'dua': 'یَا رَبِّ لَكَ الْحَمْدَ کَمَا یَنْبَغِیْ لِجَلَالِ وَجْهِكَ وَ عَظِیْمِ سُلْطَانِكَ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَللّٰهُمَّ اَنۡتَ رَبِّیۡ لَآ اِلٰهَ اِلَّآ اَنۡتَ عَلَیۡكَ تَوَکَّلۡتُ وَ اَنۡتَ رَبُّ الۡعَرۡشِ الۡعَظِیۡمِ مَا شَآءَ اللّٰهُ کَانَ وَمَا لَمۡ یَشَاۡ لَمۡ یَکُنۡ وَلَا حَوۡلَ وَلَا قُوَّۃَ اِلَّا بِاللّٰهِ الۡعَلِیِّ الۡعَظِیۡمِ اَعۡلَمُ اَنَّ اللّٰهَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ وَّ اَنَّ اللّٰهَ قَدۡ اَحَاطَ بِکُلِّ شَیۡءٍ عِلۡمًا اَللّٰهُمَّ اِنِّیۡ اَعُوۡذُبِكَ مِنۡ شَرِّ نَفۡسِیۡ وَ مِنۡ شَرِّ کُلِّ دَآبَّةٍ اَنۡتَ اٰخِذٌ بِنَاصِیَتِھَا اِنَّ رَبِّیۡ عَلٰی صِرَاطٍ مُّسۡتَقِیۡمٍ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'مَا شَآءَ اللّٰهُ لَا حَوْلَ وَ لَا قُوَّةَ اِلَّا بِاللّٰهِ اَشْھَدُ اَنَّ اللّٰهَ عَلٰی کُلِّ شَیْءٍ قَدِیْرٌ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'فَسُبۡحٰنَ اللّٰهِ حِيۡنَ تُمۡسُوۡنَ وَحِيۡنَ تُصۡبِحُوۡنَ ۞ وَلَـهُ الۡحَمۡدُ فِىۡ السَّمٰوٰتِ وَالۡاَرۡضِ وَعَشِيًّا وَّحِيۡنَ تُظۡهِرُوۡنَ ۞ يُخۡرِجُ الۡحَـىَّ مِنَ الۡمَيِّتِ وَيُخۡرِجُ الۡمَيِّتَ مِنَ الۡحَـىِّ وَيُحۡىِ الۡاَرۡضَ بَعۡدَ مَوۡتِهَا ‌ؕ وَكَذٰلِكَ تُخۡرَجُوۡنَ ۞',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ الۡحَىُّ الۡقَيُّوۡمُۚ لَا تَاۡخُذُهٗ سِنَةٌ وَّلَا نَوۡمٌ‌ؕ لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ‌ؕ مَنۡ ذَا الَّذِىۡ يَشۡفَعُ عِنۡدَهٗۤ اِلَّا بِاِذۡنِهٖ‌ؕ يَعۡلَمُ مَا بَيۡنَ اَيۡدِيۡهِمۡ وَمَا خَلۡفَهُمۡ‌ۚ وَلَا يُحِيۡطُوۡنَ بِشَىۡءٍ مِّنۡ عِلۡمِهٖۤ اِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرۡسِيُّهُ السَّمٰوٰتِ وَالۡاَرۡضَ‌‌ۚ وَلَا يَــئُوۡدُهٗ حِفۡظُهُمَا ‌ۚ وَ هُوَ الۡعَلِىُّ الۡعَظِيۡمُ',
      'times': '1',
      'description': 'آیۃ الکرسی پڑھ کر پھر سورہ مومن کی نیچے والی تین آیتیں صبح کے وقت پڑھ لیں'
    },
    {
      'dua':
          'حَمٓ ۞ تَنۡزِيۡلُ الۡكِتٰبِ مِنَ اللّٰهِ الۡعَزِيۡزِ الۡعَلِيۡمِۙ ۞ غَافِرِ الذَّنۡۢبِ وَقَابِلِ التَّوۡبِ شَدِيۡدِ الۡعِقَابِ ذِى الطَّوۡلِؕ لَاۤ اِلٰهَ اِلَّا هُوَؕ اِلَيۡهِ الۡمَصِيۡرُ ۞',
      'times': '1',
      'description': 'سورہ مومن کی ابتدائی تین آیتیں '
    },
    {'dua': 'اَعُوْذُ بِاللّٰهِ السَّمِیْعِ الْعَلِیْمِ مِنَ الشَّیْطٰنِ الرَّجِیْم', 'times': '3', 'description': ''},
    {
      'heading': '',
      'dua':
          'هُوَ اللّٰهُ الَّذِیْ لَاۤ اِلٰهَ اِلَّا هُوَۚ عٰلِمُ الْغَیْبِ وَ الشَّهَادَةِۚ هُوَ الرَّحْمٰنُ الرَّحِیْمُ ۞ هُوَ اللّٰهُ الَّذِیْ لَاۤ اِلٰهَ اِلَّا هُوَۚ اَلْمَلِكُ الْقُدُّوْسُ السَّلٰمُ الْمُؤْمِنُ الْمُهَیْمِنُ الْعَزِیْزُ الْجَبَّارُ الْمُتَكَبِّرُؕ-سُبْحٰنَ اللّٰهِ عَمَّا یُشْرِكُوْنَ ۞ هُوَ اللّٰهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْاَسْمَآءُ الْحُسْنٰىؕ یُسَبِّحُ لَهٗ مَا فِی السَّمٰوٰتِ وَ الْاَرْضِۚ-وَ هُوَ الْعَزِیْزُ الْحَکِیْمُ ۞',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَللّٰھُمَّ اَنْتَ خَلَقْتَنِیْ، وَاَنْتَ تَھْدِیْنِیْ، وَاَنْتَ تُطْعِمُنِیْ، وَاَنْتَ تَسْقِیْنِیْ، وَاَنْتَ تُمِیْتُنِیْ ، وَاَنْتَ تُحْیِیْنِیْ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          '1) حَسْبِیَ اللّٰهُ لِدِیْنِیْ\n2) حَسْبِیَ اللّٰهُ لِدِیْنِیْ\n3) حَسْبِیَ اللّٰهُ لِمَنْۢ بَغٰی عَلَیَّ\n4) حَسْبِیَ اللّٰهُ لِمَنْ حسَدَنِیْ\n5) حَسْبِیَ اللهُ لِمَنْ کَادَنِیْ بِسُوْۤءٍ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          '1) حَسْبِیَ اللّٰهُ عِنْدَ الْمَوْتِ\n2) حَسْبِیَ اللّٰهُ عِنْدَ الْمَسْاَلَةِ فِی الْقَبْرِ\n3) حَسْبِیَ اللّٰهُ عِنْدَ الْمِیْزَانِ\n4) حَسْبِیَ اللّٰهُ عِنْدَ الصِّرَاطِ\n5)حَسْبِیَ اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ عَلَیْهِ تَوَکَّلْتُ وَ اِلَیْهِ اُنِیْبُ',
      'times': '1',
      'description': ''
    },
    {'dua': 'فَاللّٰهُ خَیْرٌ حٰفِظًا۔ وَّھُوَ اَرْحَمُ الرّٰحِمِیْنَ', 'times': '3', 'description': ''}
  ];
  duaMap['asr'] = [
    {
      'dua':
          'اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ الۡحَىُّ الۡقَيُّوۡمُۚ لَا تَاۡخُذُهٗ سِنَةٌ وَّلَا نَوۡمٌ‌ؕ لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ‌ؕ مَنۡ ذَا الَّذِىۡ يَشۡفَعُ عِنۡدَهٗۤ اِلَّا بِاِذۡنِهٖ‌ؕ يَعۡلَمُ مَا بَيۡنَ اَيۡدِيۡهِمۡ وَمَا خَلۡفَهُمۡ‌ۚ وَلَا يُحِيۡطُوۡنَ بِشَىۡءٍ مِّنۡ عِلۡمِهٖۤ اِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرۡسِيُّهُ السَّمٰوٰتِ وَالۡاَرۡضَ‌‌ۚ وَلَا يَــئُوۡدُهٗ حِفۡظُهُمَا ‌ۚ وَ هُوَ الۡعَلِىُّ الۡعَظِيۡمُ ۞',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اٰمَنَ الرَّسُوۡلُ بِمَاۤ اُنۡزِلَ اِلَيۡهِ مِنۡ رَّبِّهٖ وَ الۡمُؤۡمِنُوۡنَ‌ؕ كُلٌّ اٰمَنَ بِاللّٰهِ وَمَلٰٓئِكَتِهٖ وَكُتُبِهٖ وَرُسُلِهٖ ۚ  لَا نُفَرِّقُ بَيۡنَ اَحَدٍ مِّنۡ رُّسُلِهٖ‌  ۚ   وَقَالُوۡا سَمِعۡنَا وَاَطَعۡنَا‌ ۖ غُفۡرَانَكَ رَبَّنَا وَاِلَيۡكَ الۡمَصِيۡرُ ۞ لَا يُكَلِّفُ اللّٰهُ نَفۡسًا اِلَّا وُسۡعَهَا ‌ؕ لَهَا مَا كَسَبَتۡ وَعَلَيۡهَا مَا اكۡتَسَبَتۡ‌ؕ رَبَّنَا لَا تُؤَاخِذۡنَاۤ اِنۡ نَّسِيۡنَاۤ اَوۡ اَخۡطَاۡنَا ‌ۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَيۡنَاۤ اِصۡرًا كَمَا حَمَلۡتَهٗ عَلَى الَّذِيۡنَ مِنۡ قَبۡلِنَا ‌‌ۚرَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهٖ‌ ۚ وَاعۡفُ عَنَّا وَاغۡفِرۡ لَنَا وَارۡحَمۡنَا ۚ اَنۡتَ مَوۡلٰٮنَا فَانۡصُرۡنَا عَلَى الۡقَوۡمِ الۡكٰفِرِيۡنَ ۞',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'رَضِيْتُ بِاللّٰهِ رَبًّا ، وَبِالْاِسْلَامِ دِينًا ، وَبِمُحَمَّدٍ صَلَّی اللّٰهُ عَلَیْهِ وَسَلَّمَ نَبِيًّا',
      'times': '3',
      'description': ''
    },
    {
      'dua':
          'يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ اَسْتَغِيثُ، اَصْلِحْ لِي شَأْنِی كُلَّهُ، وَلَا تَكِلْنِی اِلَى نَفْسِی طَرَفَةَ عَيْنٍ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'بِسْمِ اللّٰهِ الَّذِی لَا يَضُرُّ مَعَ اسْمِهِ شَیْءٌ فِی الأرضِ وَلاَ فِی السَّمَاءِ وَهُوَ السَّمِيعُ العَلِيْمُ',
      'times': '3',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ عَافِنِی فِي بَدَنِی اللّٰهُمَّ عَافِنِي فِی سَمْعِي اللّٰهُمَّ عَافِنِی فِی بَصَرِیْ لَا اِلَهَ اِلاَّ اَنْتَ اللّٰهُمَّ اِنِّی اَعُوذُبِكَ مِنَ الْكُفْرِ وَالفَقْرِ وَاَعُوذُبِكَ مِنْ عَذَابِ القَبْرِ لَا اِلَهَ اِلاَّ أَنْتَ',
      'times': '3',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ فَاطِرَ السَّمَوَاتِ وَالاَرْضِ عَالِمَ الغَيْبِ وَالشَّهَادةِ، رَبَّ كُلِّ شَيءٍ وَمَلِيكَهُ، اَشْهَدُ اَنْ لَا اِلٰهَ اِلاَّ اَنْتَ، اَعُوذُبِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ وَ اَنْ اَقْتَرِفَ عَلٰی نَفْسِی سُوْٓءً اَوْ اَجُرَّہُ اِلٰی مُسْلِمٕ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ اَنْتَ رَبِّی لّا اِلَهَ اِلَّا أَنْتَ، خَلَقْتَنِیْ وَاَنَا عَبْدُكَ، وَاَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتَ، اَعُوذُبِكَ مِنْ شَرِّ مَا صَنَعْتَ، اَبُوءُ لَكَ بِنِعْمَتِكَ عَلَیَّ، وَاَبُوءُ لَكَ بِذَنْبِیْ فَاغْفِر لِی فَاِنَّهُ لَا يَغْفِرُ الذُّنُوبَ اِلَّا أَنْتَ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ اِنِّی اَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْیَا وَالْاَخِرَۃِ اللّٰهُمَّ اِنِّي اَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَایَ وَاَهْلِی وَمَالِی ، اللّٰهُمَّ اسْتُرْ عَوْرَاتِی وَآمِنْ رَوْعَاتِی ، اللّٰهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِی وَعَنْ يَّمِينِی وَعَنْ شِمَالِی وَمِنْ فَوْقِی وَاَعُوذُ بِعَظَمَتِكَ اَنْ اُغْتَالَ مِنْ تَحْتِی',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ اِنِّي اَعُوذُبِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَاَعُوذُبِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَاَعُوذُبِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَاَعُوذُبِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَللّٰهُمَّ اَنۡتَ رَبِّیۡ لَآ اِلٰهَ اِلَّا اَنۡتَ عَلَیۡكَ تَوَکَّلۡتُ وَ اَنۡتَ رَبُّ الۡعَرۡشِ الۡعَظِیۡمِ مَا شَآءَ اللّٰهُ کَانَ وَمَا لَمۡ یَشَاۡ لَمۡ یَکُنۡ وَلَا حَوۡلَ وَلَا قُوَّۃَ اِلَّا بِاللّٰهِ الۡعَلِیِّ الۡعَظِیۡمِ اَعۡلَمُ اَنَّ اللّٰهَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ وَّ اَنَّ اللّٰهَ قَدۡ اَحَاطَ بِکُلِّ شَیۡءٍ عِلۡمًا اَللّٰهُمَّ اِنِّیۡ اَعُوۡذُبِكَ مِنۡ شَرِّ نَفۡسِیۡ وَ مِنۡ شَرِّ کُلِّ دَآبَّةٍ اَنۡتَ اٰخِذٌ بِنَاصِیَتِھَا اِنَّ رَبِّیۡ عَلٰی صِرَاطٍ مُّسۡتَقِیۡمٍ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'سُبْحَانَ اللّٰهِ عَدَدَ مَا خَلَقَ، سُبْحَانَ اللّٰهِ مِلْءَ مَا خَلَقَ، سُبْحَانَ اللّٰهِ عَدَدَ مَا فِی الْأَرْضِ وَالسَّمَاءِ، سُبْحَانَ اللّٰهِ مِلْءَ مَا فِی الْأَرْض وَ السَّماء، سُبْحَانَ اللّٰهِ عَدَدَ مَا أَحْصَى كِتَابَهُ، و سُبْحَانَ اللّٰهِ مِلْءَ مَا أَحْصَى كِتَابَهُ، سُبْحَانَ اللّٰهِ عَدَدَ كُلِّ شَیْءٍ، سُبْحَانَ اللّٰهِ مِلْءَ كُلِّ شَیْءٍ، اَلْحَمْدُ لِلّٰهِ عَدَدَ مَا خَلَقَ، اَلْحَمْدُ لِلّٰهِ مِلْءَ مَا خَلَقَ، وَ الْحَمْدُ لِلّٰهِ عَدَدَ مَا فِی الْأَرْضِ وَالسَّمَاءِ ، وَ الْحَمْدُ لِلّٰهِ مِلْءَ مَا فِی الْأَرْض وَ السَّماء، وَ الْحَمْدُ لِلّٰهِ عَدَدَ مَا أَحْصَى كِتَابَهُ، و الْحَمْدُ لِلّٰهِ مِلْءَ مَا أَحْصَى كِتَابَهُ، وَ الْحَمْدُ لِلّٰهِ كُلِّ شَیْءٍ، وَالْحَمْدُ لِلّٰهِ مِلْءَ كُلِّ شَیْءٍ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'فَسُبۡحٰنَ اللّٰهِ حِيۡنَ تُمۡسُوۡنَ وَحِيۡنَ تُصۡبِحُوۡنَ ۞ وَلَـهُ الۡحَمۡدُ فِىۡ السَّمٰوٰتِ وَالۡاَرۡضِ وَعَشِيًّا وَّحِيۡنَ تُظۡهِرُوۡنَ ۞ يُخۡرِجُ الۡحَـىَّ مِنَ الۡمَيِّتِ وَيُخۡرِجُ الۡمَيِّتَ مِنَ الۡحَـىِّ وَيُحۡىِ الۡاَرۡضَ بَعۡدَ مَوۡتِهَا ‌ؕ وَكَذٰلِكَ تُخۡرَجُوۡنَ ۞',
      'times': '1',
      'description': ''
    },
    {'dua': 'اَعُوْذُ بِاللّٰهِ السَّمِیْعِ الْعَلِیْمِ مِنَ الشَّیْطٰنِ الرَّجِیْم', 'times': '3', 'description': ''},
    {
      'dua':
          'هُوَ اللّٰهُ الَّذِیْ لَاۤ اِلٰهَ اِلَّا هُوَۚ عٰلِمُ الْغَیْبِ وَ الشَّهَادَةِۚ هُوَ الرَّحْمٰنُ الرَّحِیْمُ ۞ هُوَ اللّٰهُ الَّذِیْ لَاۤ اِلٰهَ اِلَّا هُوَۚ اَلْمَلِكُ الْقُدُّوْسُ السَّلٰمُ الْمُؤْمِنُ الْمُهَیْمِنُ الْعَزِیْزُ الْجَبَّارُ الْمُتَكَبِّرُؕ سُبْحٰنَ اللّٰهِ عَمَّا یُشْرِكُوْنَ ۞ هُوَ اللّٰهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْاَسْمَآءُ الْحُسْنٰىؕ یُسَبِّحُ لَهٗ مَا فِی السَّمٰوٰتِ وَ الْاَرْضِۚ وَ هُوَ الْعَزِیْزُ الْحَکِیْمُ ۞',
      'times': '1',
      'description': ''
    },
  ];
  duaMap['maghrib'] = [
    {
      'dua':
          'بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ\nقُلْ هُوَ اللّٰهُ اَحَدٌ ۞ اَللّٰهُ الصَّمَدُ ۞ لَمْ يَلِدْ وَلَمْ يُوْلَدْ ۞ وَلَمْ يَكُنْ لَّهُ كُفُوًا اَحَدٌ ۞\n\nبِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ\nقُلْ اَعُوْذُ بِرَبِّ الْفَلَقِ ۞ مِنْ شَرِّ مَا خَلَقَ ۞ وَمِنْ شَرِّ غَاسِقٍ اِذَا وَقَبَ ۞ وَمِنْ شَرِّ النَّفّٰثٰتِ فِى الْعُقَدِ ۞ وَمِنْ شَرِّ حَاسِدٍ اِذَا حَسَدَ ۞\n\nبِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ\nقُلْ اَعُوْذُ بِرَبِّ النَّاسِ ۞ مَلِكِ النَّاسِ ۞ اِلٰهِ النَّاسِ ۞ مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ۞ اَلَّذِىْ يُوَسْوِسُ فِىْ صُدُوْرِ النَّاسِ ۞ مِنَ الْجِنَّةِ وَالنَّاسِ ۞',
      'times': '3',
      'description': ''
    },
    {
      'dua': 'حَسْبِـیَ اللّٰهُ لَا إلٰهَ إلَّا هُوَ عَلَيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم',
      'times': '7',
      'description': 'مذکورہ دعا چاہے سچے دل سے پڑھے یا جھوٹے دل سے پڑھے پریشانی دور ہو گی'
    },
    {
      'dua':
          'اللّٰهُمَّ اِنِّي اَمْسَیْتُ اُشْهِدُكَ ، وَاُشْهِدُ حَمَلَةَ عَرْشِكَ وَمَلَائِكَتَكَ وَجَمِيعَ خَلْقِكَ ، اَنَّكَ َنْتَ اللّٰهُ ، لَا اِلَهَ اِلَّا اَنْتَ ، وَحْدَكَ لَا شَرِيكَ لَكَ ، وَاَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ',
      'times': '4',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ اِنِّی اَمْسَیْتُ مِنْكَ فِي نِعْمَةٍ وَعَافِيَةٍ وَسِتْرٍ؛ فَاَتْمِمْ عَلَيَّ نِعْمَتَكَ وَعَافِيَتَكَ وَسِتْرَكَ فِي الدُّنْيَا وَالْآخِرَةِ',
      'times': '3',
      'description': ''
    },
    {
      'dua':
          'اللّٰهُمَّ مَا اَمْسٰی بِی مِـنْ نِعْمَةٍ اَو باَحَدٍ مِـنْ خَلْقِك ، فَمِنْكَ وَحْـدَكَ لَا شَرِيْكََ لَكَ ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْر',
      'times': '1',
      'description': ''
    },
    {'dua': 'اللّٰھُمَّ اَجِرْنِیْ مِنَ النَّارِ', 'times': '7', 'description': ''},
    {
      'dua': 'یَا رَبِّ لَكَ الْحَمْدَ کَمَا یَنْبَغِیْ لِجَلَالِ وَجْهِكَ وَ عَظِیْمِ سُلْطَانِكَ',
      'times': '1',
      'description': ''
    },
    {
      'dua': 'اللّٰهُمَّ ھَذٰآ اِقْبَالُ لَیْلِكَ وَ اِدْبَارُ نَھَارِكَ وَاَصْوَاتُ دُعَاتِكَ فَاغْفِرْلِی',
      'times': '1',
      'description': 'نیچے والی دعا مغرب کی اذانوں کے وقت پڑھ لیجئے'
    },
    {
      'dua':
          'اَللّٰھُمَّ اَنْتَ خَلَقْتَنِیْ، وَاَنْتَ تَھْدِیْنِیْ، وَاَنْتَ تُطْعِمُنِیْ، وَاَنْتَ تَسْقِیْنِیْ، وَاَنْتَ تُمِیْتُنِیْ ، وَاَنْتَ تُحْیِیْنِیْ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَعُوْذُ بِوَجْهِ اللّٰهِ الْکَرِیْمِ، وَبِکَلِمَاتِ اللّٰهِ التَّآمَّآتِ الَّتِیْ لَاَیُجَاوِزُھُنَّ بَرٌّ وَّلَاَ فَاجِرٌ مِنْ شَرِّ مَا یَنْزِلُ مِنَ السَّمَآءِ وَمِنْ شَرِّ مَا یَعْرُجُ فِیْھَا، وَ شَرِّ مَا ذَرَأ فِیْ الْاَرْضِ، وَ شَرِّ مَا یَخْرُجُ مِنْھَا، وَمِنْ فِتَنِ الَّلیْلِ وَالنَّھَارِ، وَمِنْ طَوَارِقِ اللَّیْلِ وَالنَّھَارِ اِلَّا طَارِقًا یَّطْرِقُ بِخَیْرٍ یَارَحْمٰنُ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَمْسَیْنَا وَ اَمْسَی المُلْكُ لِلّٰهِ وَالْحَمْدُ کُلُّهٗ لِلّٰهِ اَعُوْذُ بِاللّٰهِ الَّذِی یُمْسِكُ السَّمآءَ اَنْ تَقَعَ عَلٰی الْاَرْضِ اِلَّا بِاِذْنِهِ مِنْ شَرِّ مَا خَلَقَ وَ ذَرَأَ وَ مِنْ شَرِّ الشَّیْطَانِ وَ شِرْکِهٖ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَعُوذُ بِوَجْهِ اللّٰهِ الْعَظِیمِ، الَّذِی لَیْسَ شَیْءٌ اَعْظَمَ مِنْهُ، وَبِکَلِمَاتِ اللّٰهِ التَّامَّاتِ، الَّتِی لَا یُجَاوِزُهُنَّ بَرٌّ وَلاَ فَاجِرٌ، وَبِاَسْمَاء ِ اللّٰهِ الْحُسْنَی کُلِّها, مَا عَلِمْتُ مِنْها وَمَا لَمْ اَعْلَمْ، مِنْ شَرِّ مَا خَلَقَ وَبَرَاَ وَذَرَاَ',
      'times': '1',
      'description': ''
    },
    {
      'dua': 'اللّٰهُمَّ اِنِّي اَسْاَلُك مِن فُجَاءَةِ الخَيِرِ وَاَعُوْذُ بِكَ مِنْ فُجَاءَةِ الشَّرِّ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَمْسَیْنَا وَاَمْسَی الْمُلْكُ لِلّٰهِ رَبِّ الْعَالَمِیْنَ اَللّٰھُمَّ اِنِّیْ اَسْأَلُك خَیْرَ ھٰذَہ اللَّیْلَةِ وَفَتْحَھَا وَنَصْرَھَا وَ بَرَکَتَھَا وَ ھُدَاھَا وَاَعُوْذُبِكَ مَنْ شَرِّ مَا فِیْھَا وَشَرِّ مَا بَعْدَھَا',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَمْسَیْنَا عَلٰی فِطْرَۃِ الْاِسْلَامِ وَ کَلِمَةِ الْاِخْلَاصِ وَعَلٰی دِینِ نَبِیِّنَا مُحَمَّدٍ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ وَعَلٰی مِلَّةِ اَبِیْنَا اِبْرَاہِیمَ حَنِیفًا مُسْلِمًا وَمَا کَانَ مِنَ الْمُشْرِکِینَ',
      'times': '1',
      'description': ''
    },
  ];
  duaMap['isha'] = [
    {'dua': 'اَعُوْذُ بِکَلِمَاتِ اللّٰهِ التَّآمَّاتِ مِنْ شَرِّ مَا خَلَقَ', 'times': '3', 'description': ''},
    {
      'dua':
          'اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ الۡحَىُّ الۡقَيُّوۡمُۚ لَا تَاۡخُذُهٗ سِنَةٌ وَّلَا نَوۡمٌ‌ؕ لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الۡاَرۡضِ‌ؕ مَنۡ ذَا الَّذِىۡ يَشۡفَعُ عِنۡدَهٗۤ اِلَّا بِاِذۡنِهٖ‌ؕ يَعۡلَمُ مَا بَيۡنَ اَيۡدِيۡهِمۡ وَمَا خَلۡفَهُمۡ‌ۚ وَلَا يُحِيۡطُوۡنَ بِشَىۡءٍ مِّنۡ عِلۡمِهٖۤ اِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرۡسِيُّهُ السَّمٰوٰتِ وَالۡاَرۡضَ‌‌ۚ وَلَا يَــئُوۡدُهٗ حِفۡظُهُمَا ‌ۚ وَ هُوَ الۡعَلِىُّ الۡعَظِيۡمُ ۞',
      'times': '1',
      'description': 'آیۃ الکرسی پڑھ کر پھر سورہ مومن کی نیچے والی تین آیتیں صبح کے وقت پڑھ لیں'
    },
    {
      'dua':
          'حَمٓ ۞ تَنۡزِيۡلُ الۡكِتٰبِ مِنَ اللّٰهِ الۡعَزِيۡزِ الۡعَلِيۡمِۙ ۞ غَافِرِ الذَّنۡۢبِ وَقَابِلِ التَّوۡبِ شَدِيۡدِ الۡعِقَابِ ذِى الطَّوۡلِؕ لَاۤ اِلٰهَ اِلَّا هُوَؕ اِلَيۡهِ الۡمَصِيۡرُ ۞',
      'times': '1',
      'description': 'آیۃ الکرسی پڑھ کر پھر سورہ مومن کی نیچے والی تین آیتیں صبح کے وقت پڑھ لیں'
    },
    {
      'dua':
          'اَفَحَسِبۡتُمۡ اَنَّمَا خَلَقۡنٰكُمۡ عَبَثًا وَّاَنَّكُمۡ اِلَيۡنَا لَا تُرۡجَعُوۡنَ ۞ فَتَعٰلَى اللّٰهُ الۡمَلِكُ الۡحَـقُّ‌ ۚ لَاۤ اِلٰهَ اِلَّا هُوَ‌ۚ رَبُّ الۡعَرۡشِ الۡـكَرِيۡمِ ۞ وَمَنۡ يَّدۡعُ مَعَ اللّٰهِ اِلٰهًا اٰخَرَۙ لَا بُرۡهَانَ لَهٗ بِهٖۙ فَاِنَّمَا حِسَابُهٗ عِنۡدَ رَبِّهٖؕ اِنَّهٗ لَا يُفۡلِحُ الۡـكٰفِرُوۡنَ ۞ وَقُلْ رَّبِّ اغۡفِرۡ وَارۡحَمۡ وَاَنۡتَ خَيۡرُ الرّٰحِمِيۡن ۞',
      'times': '1',
      'description': ''
    },
    {'dua': 'منجیات', 'times': '1', 'description': ''},
    {
      'dua': 'اَللّٰھُمَّ اغْفِرْلِیْ وَلِلْمُؤْمِنِیْنَ وَالْمُؤْمِنَاتِ وَالْمُسْلِمِیْنَ وَالْمُسْلِمَاتِ',
      'times': '25 یا 27',
      'description': ''
    },
    {
      'dua': 'اَللّٰهُ اَکْبَرُ کَبِیْرًا، وَالْحَمْدُ لِلّٰهِ کَثِیْرًا، وَّسُبْحَانَ اللّٰهِ بُکْرَۃً وَّاَصِیْلاً',
      'times': '1',
      'description': ''
    },
    {'dua': 'اَعُوذُ بِاللّٰهِ مِنَ الشَّيْطَانِ الرَّجِيمِ', 'times': '10', 'description': ''},
    {
      'dua':
          'اَللّٰھُمَّ صَلِّ عَلٰی مُحَمَّدٍ عَبْدِكَ وَرَسُوْلِكَ وَ عَلٰی الْمُؤمِنِیْنَ وَالْمُؤمِنَاتِ وَالْمُسْلِمِیْنَ وَالْمُسْلِمَاتِ',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'اَللّٰھُمَّ لَكَ الْحَمْدُ کَمَا اَنْتَ اَھْلُهُ فَصَلِّ وَ سَلِّمْ عَلٰی سَیَّدِنَا مُحَمَّدٍ کَمَا اَنتَ اَھلُهُ وَافْعَل بِنَا مَآ اَنْتَ اَھْلُهُ فَاِنَّكَ اَھْلُ التَّقوٰی وَاَھْلُ الْمَغفِرَةِ',
      'times': '1',
      'description': ''
    },
    {
      'dua': 'اللّٰهُمَّ مَغْفِرَتِكَ اَوْسَعُ مِنْ ذُنُوبِیْ وَرَحْمَتُكَ اَرْجٰى عِنْدِی مِنْ عَمَلِیْ',
      'times': '3',
      'description': ''
    },
    {
      'dua':
          'تَوَكَّلْتُ عَلَى الْحَیِّ الَّذِیْ لَا یَمُوْتُ اَلْحَمْدُ لِلّٰهِ الَّذِیْ لَمْ یَتَّخِذْ وَلَدًا وَّ لَمْ یَكُنْ لَّهٗ شَرِیْكٌ فِی الْمُلْكِ وَ لَمْ یَكُنْ لَّهٗ وَلِیٌّ مِّنَ الذُّلِّ وَ كَبِّرْهُ تَكْبِیْرًا',
      'times': '1',
      'description': ''
    },
    {
      'dua':
          'بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ\nقُلْ هُوَ اللّٰهُ اَحَدٌ ۞ اَللّٰهُ الصَّمَدُ ۞ لَمْ يَلِدْ وَلَمْ يُوْلَدْ ۞ وَلَمْ يَكُنْ لَّهُ كُفُوًا اَحَدٌ ۞',
      'times': '10',
      'description': ''
    },
  ];

  for (int x = 0; x < headingList!.length; x++) {
    duaMap[prayerTime]![x]['heading']=headingList[x][languageSelected]!;
  }

  return duaMap[prayerTime];
}
